#ifndef HIDL_GENERATED_ANDROID_HARDWARE_RADIO_V1_6_TYPES_H
#define HIDL_GENERATED_ANDROID_HARDWARE_RADIO_V1_6_TYPES_H

#include <android/hardware/radio/1.0/types.h>
#include <android/hardware/radio/1.1/types.h>
#include <android/hardware/radio/1.2/types.h>
#include <android/hardware/radio/1.4/types.h>
#include <android/hardware/radio/1.5/types.h>
#include <android/hidl/safe_union/1.0/types.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace radio {
namespace V1_6 {

// Forward declaration for forward reference support:
struct QosBandwidth;
struct EpsQos;
struct NrQos;
enum class QosFlowIdRange : uint8_t;
struct Qos;
enum class QosProtocol : int8_t;
enum class QosFilterDirection : int8_t;
enum class QosPortRange : uint16_t;
enum class RadioError : int32_t;
struct RadioResponseInfo;
struct PortRange;
struct MaybePort;
struct QosFilter;
struct QosSession;
enum class HandoverFailureMode : int8_t;
enum class DataCallFailCause : int32_t;
enum class SliceServiceType : uint8_t;
enum class SliceStatus : int8_t;
struct SliceInfo;
struct OptionalSliceInfo;
struct SetupDataCallResult;
enum class NrDualConnectivityState : int8_t;
struct LinkCapacityEstimate;
enum class DataThrottlingAction : int8_t;
enum class VopsIndicator : uint8_t;
enum class EmcIndicator : uint8_t;
enum class EmfIndicator : uint8_t;
struct NrVopsInfo;
struct LteSignalStrength;
struct NrSignalStrength;
struct SignalStrength;
struct CellInfoLte;
struct CellInfoNr;
struct CellInfo;
struct NetworkScanResult;
struct RegStateResult;
struct Call;
enum class NgranBands : int32_t;
struct PhysicalChannelConfig;
struct OptionalDnn;
struct OsAppId;
struct OptionalOsAppId;
struct TrafficDescriptor;
struct OptionalTrafficDescriptor;
struct SlicingConfig;
struct UrspRule;
struct OptionalPdpProtocolType;
enum class SscMode : int8_t;
struct OptionalSscMode;
struct RouteSelectionDescriptor;
enum class PublicKeyType : int8_t;
struct ImsiEncryptionInfo;

// Order of inner types was changed for forward reference support.
struct PhonebookCapacity;
struct PhonebookRecordInfo;
enum class PbReceivedStatus : int8_t;

struct QosBandwidth final {
    /**
     * Maximum bit rate possible on the bearer
     */
    uint32_t maxBitrateKbps __attribute__ ((aligned(4)));
    /**
     * Minimum bit rate that is guaranteed to be provided by the network
     */
    uint32_t guaranteedBitrateKbps __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::QosBandwidth, maxBitrateKbps) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::QosBandwidth, guaranteedBitrateKbps) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::QosBandwidth) == 8, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::QosBandwidth) == 4, "wrong alignment");

/**
 * LTE/EPS Quality of Service parameters as per 3gpp spec 24.301 sec 9.9.4.3.
 */
struct EpsQos final {
    /**
     * Quality of Service Class Identifier (QCI), see 3GPP TS 23.203 and 29.212.
     * The allowed values are standard values(1-9, 65-68, 69-70, 75, 79-80, 82-85)
     * defined in the spec and operator specific values in the range 128-254.
     */
    uint16_t qci __attribute__ ((aligned(2)));
    ::android::hardware::radio::V1_6::QosBandwidth downlink __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_6::QosBandwidth uplink __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::EpsQos, qci) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::EpsQos, downlink) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::EpsQos, uplink) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::EpsQos) == 20, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::EpsQos) == 4, "wrong alignment");

/**
 * 5G Quality of Service parameters as per 3gpp spec 24.501 sec 9.11.4.12
 */
struct NrQos final {
    /**
     * 5G QOS Identifier (5QI), see 3GPP TS 24.501 and 23.501.
     * The allowed values are standard values(1-9, 65-68, 69-70, 75, 79-80, 82-85)
     * defined in the spec and operator specific values in the range 128-254.
     */
    uint16_t fiveQi __attribute__ ((aligned(2)));
    ::android::hardware::radio::V1_6::QosBandwidth downlink __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_6::QosBandwidth uplink __attribute__ ((aligned(4)));
    /**
     * QOS flow identifier of the QOS flow description in the
     * range of QosFlowIdRange::MIN to QosFlowIdRange::MAX
     */
    uint8_t qfi __attribute__ ((aligned(1)));
    uint16_t averagingWindowMs __attribute__ ((aligned(2)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::NrQos, fiveQi) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::NrQos, downlink) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::NrQos, uplink) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::NrQos, qfi) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::NrQos, averagingWindowMs) == 22, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::NrQos) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::NrQos) == 4, "wrong alignment");

/**
 * Allowed values for 5G QOS flow identifier
 */
enum class QosFlowIdRange : uint8_t {
    MIN = 1,
    MAX = 63,
};

/**
 * EPS or NR QOS parameters
 */
struct Qos final {
    enum class hidl_discriminator : uint8_t {
        noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
        eps = 1,  // ::android::hardware::radio::V1_6::EpsQos
        nr = 2,  // ::android::hardware::radio::V1_6::NrQos
    };

    Qos();
    ~Qos();
    Qos(Qos&&);
    Qos(const Qos&);
    Qos& operator=(Qos&&);
    Qos& operator=(const Qos&);

    void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
    void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
    ::android::hidl::safe_union::V1_0::Monostate& noinit();
    const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

    void eps(const ::android::hardware::radio::V1_6::EpsQos&);
    void eps(::android::hardware::radio::V1_6::EpsQos&&);
    ::android::hardware::radio::V1_6::EpsQos& eps();
    const ::android::hardware::radio::V1_6::EpsQos& eps() const;

    void nr(const ::android::hardware::radio::V1_6::NrQos&);
    void nr(::android::hardware::radio::V1_6::NrQos&&);
    ::android::hardware::radio::V1_6::NrQos& nr();
    const ::android::hardware::radio::V1_6::NrQos& nr() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::radio::V1_6::Qos, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
        ::android::hardware::radio::V1_6::EpsQos eps __attribute__ ((aligned(4)));
        ::android::hardware::radio::V1_6::NrQos nr __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::radio::V1_6::Qos::hidl_union) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::Qos::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::android::hardware::radio::V1_6::Qos::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::Qos::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::radio::V1_6::Qos) == 28, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::Qos) == 4, "wrong alignment");

/**
 * Next header protocol numbers defined by IANA, RFC 5237
 */
enum class QosProtocol : int8_t {
    /**
     * No protocol specified
     */
    UNSPECIFIED = -1 /* -1 */,
    /**
     * Transmission Control Protocol
     */
    TCP = 6,
    /**
     * User Datagram Protocol
     */
    UDP = 17,
    /**
     * Encapsulating Security Payload Protocol
     */
    ESP = 50,
    /**
     * Authentication Header
     */
    AH = 51,
};

enum class QosFilterDirection : int8_t {
    DOWNLINK = 0,
    UPLINK = 1,
    BIDIRECTIONAL = 2,
};

/**
 * Allowed port numbers
 */
enum class QosPortRange : uint16_t {
    MIN = 20,
    MAX = 65535,
};

enum class RadioError : int32_t {
    NONE = 0,
    RADIO_NOT_AVAILABLE = 1,
    GENERIC_FAILURE = 2,
    PASSWORD_INCORRECT = 3,
    SIM_PIN2 = 4,
    SIM_PUK2 = 5,
    REQUEST_NOT_SUPPORTED = 6,
    CANCELLED = 7,
    OP_NOT_ALLOWED_DURING_VOICE_CALL = 8,
    OP_NOT_ALLOWED_BEFORE_REG_TO_NW = 9,
    SMS_SEND_FAIL_RETRY = 10,
    SIM_ABSENT = 11,
    SUBSCRIPTION_NOT_AVAILABLE = 12,
    MODE_NOT_SUPPORTED = 13,
    FDN_CHECK_FAILURE = 14,
    ILLEGAL_SIM_OR_ME = 15,
    MISSING_RESOURCE = 16,
    NO_SUCH_ELEMENT = 17,
    DIAL_MODIFIED_TO_USSD = 18,
    DIAL_MODIFIED_TO_SS = 19,
    DIAL_MODIFIED_TO_DIAL = 20,
    USSD_MODIFIED_TO_DIAL = 21,
    USSD_MODIFIED_TO_SS = 22,
    USSD_MODIFIED_TO_USSD = 23,
    SS_MODIFIED_TO_DIAL = 24,
    SS_MODIFIED_TO_USSD = 25,
    SUBSCRIPTION_NOT_SUPPORTED = 26,
    SS_MODIFIED_TO_SS = 27,
    LCE_NOT_SUPPORTED = 36,
    NO_MEMORY = 37,
    INTERNAL_ERR = 38,
    SYSTEM_ERR = 39,
    MODEM_ERR = 40,
    INVALID_STATE = 41,
    NO_RESOURCES = 42,
    SIM_ERR = 43,
    INVALID_ARGUMENTS = 44,
    INVALID_SIM_STATE = 45,
    INVALID_MODEM_STATE = 46,
    INVALID_CALL_ID = 47,
    NO_SMS_TO_ACK = 48,
    NETWORK_ERR = 49,
    REQUEST_RATE_LIMITED = 50,
    SIM_BUSY = 51,
    SIM_FULL = 52,
    NETWORK_REJECT = 53,
    OPERATION_NOT_ALLOWED = 54,
    EMPTY_RECORD = 55,
    INVALID_SMS_FORMAT = 56,
    ENCODING_ERR = 57,
    INVALID_SMSC_ADDRESS = 58,
    NO_SUCH_ENTRY = 59,
    NETWORK_NOT_READY = 60,
    NOT_PROVISIONED = 61,
    NO_SUBSCRIPTION = 62,
    NO_NETWORK_FOUND = 63,
    DEVICE_IN_USE = 64,
    ABORTED = 65,
    INVALID_RESPONSE = 66,
    OEM_ERROR_1 = 501,
    OEM_ERROR_2 = 502,
    OEM_ERROR_3 = 503,
    OEM_ERROR_4 = 504,
    OEM_ERROR_5 = 505,
    OEM_ERROR_6 = 506,
    OEM_ERROR_7 = 507,
    OEM_ERROR_8 = 508,
    OEM_ERROR_9 = 509,
    OEM_ERROR_10 = 510,
    OEM_ERROR_11 = 511,
    OEM_ERROR_12 = 512,
    OEM_ERROR_13 = 513,
    OEM_ERROR_14 = 514,
    OEM_ERROR_15 = 515,
    OEM_ERROR_16 = 516,
    OEM_ERROR_17 = 517,
    OEM_ERROR_18 = 518,
    OEM_ERROR_19 = 519,
    OEM_ERROR_20 = 520,
    OEM_ERROR_21 = 521,
    OEM_ERROR_22 = 522,
    OEM_ERROR_23 = 523,
    OEM_ERROR_24 = 524,
    OEM_ERROR_25 = 525,
    /**
     * 1X voice and SMS are not allowed simulteneously.
     */
    SIMULTANEOUS_SMS_AND_CALL_NOT_ALLOWED = 67,
    /**
     * Access is barred.
     */
    ACCESS_BARRED = 68,
    /**
     * SMS is blocked due to call control, e.g., resource unavailable
     * in the SMR entity.
     */
    BLOCKED_DUE_TO_CALL = 69,
    /**
     * Returned from setRadioPowerResponse when detecting RF HW issues. Some RF
     * Front-End(RFFE) components like antenna are considered critical for modem
     * to provide telephony service. This RadioError is used when modem detect
     * such RFFE problem.
     */
    RF_HARDWARE_ISSUE = 70,
    /**
     * Returned from setRadioPowerResponse when detecting no RF calibration
     * issue. Unlike RF_HARDWARE_ISSUE, this is a SW problem and no HW repair is
     * needed.
     */
    NO_RF_CALIBRATION_INFO = 71,
};

/**
 * Overwritten from @1.0::RadioResponseInfo in order to update the RadioError to 1.6 version.
 */
struct RadioResponseInfo final {
    ::android::hardware::radio::V1_0::RadioResponseType type __attribute__ ((aligned(4)));
    int32_t serial __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_6::RadioError error __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::RadioResponseInfo, type) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::RadioResponseInfo, serial) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::RadioResponseInfo, error) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::RadioResponseInfo) == 12, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::RadioResponseInfo) == 4, "wrong alignment");

/**
 * Defines range of ports. start and end are the first and last port numbers
 * (inclusive) in the range. Both start and end are in QosPortRange.MIN to
 * QosPortRange.MAX range. A single port shall be represented by the same
 * start and end value.
 */
struct PortRange final {
    int32_t start __attribute__ ((aligned(4)));
    int32_t end __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::PortRange, start) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PortRange, end) == 4, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::PortRange) == 8, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::PortRange) == 4, "wrong alignment");

/**
 * Port is optional, contains either single port or range of ports
 */
struct MaybePort final {
    enum class hidl_discriminator : uint8_t {
        noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
        range = 1,  // ::android::hardware::radio::V1_6::PortRange
    };

    MaybePort();
    ~MaybePort();
    MaybePort(MaybePort&&);
    MaybePort(const MaybePort&);
    MaybePort& operator=(MaybePort&&);
    MaybePort& operator=(const MaybePort&);

    void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
    void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
    ::android::hidl::safe_union::V1_0::Monostate& noinit();
    const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

    void range(const ::android::hardware::radio::V1_6::PortRange&);
    void range(::android::hardware::radio::V1_6::PortRange&&);
    ::android::hardware::radio::V1_6::PortRange& range();
    const ::android::hardware::radio::V1_6::PortRange& range() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::radio::V1_6::MaybePort, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
        ::android::hardware::radio::V1_6::PortRange range __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::radio::V1_6::MaybePort::hidl_union) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::MaybePort::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::android::hardware::radio::V1_6::MaybePort::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::MaybePort::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::radio::V1_6::MaybePort) == 12, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::MaybePort) == 4, "wrong alignment");

/**
 * See 3gpp 24.008 10.5.6.12 and 3gpp 24.501 9.11.4.13
 */
struct QosFilter final {
    // Forward declaration for forward reference support:
    struct TypeOfService;
    struct Ipv6FlowLabel;
    struct IpsecSpi;

    struct TypeOfService final {
        enum class hidl_discriminator : uint8_t {
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            value = 1,  // uint8_t
        };

        TypeOfService();
        ~TypeOfService();
        TypeOfService(TypeOfService&&);
        TypeOfService(const TypeOfService&);
        TypeOfService& operator=(TypeOfService&&);
        TypeOfService& operator=(const TypeOfService&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void value(uint8_t);
        uint8_t& value();
        uint8_t value() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::radio::V1_6::QosFilter::TypeOfService, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            uint8_t value __attribute__ ((aligned(1)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::radio::V1_6::QosFilter::TypeOfService::hidl_union) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_6::QosFilter::TypeOfService::hidl_union) == 1, "wrong alignment");
        static_assert(sizeof(::android::hardware::radio::V1_6::QosFilter::TypeOfService::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_6::QosFilter::TypeOfService::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::radio::V1_6::QosFilter::TypeOfService) == 2, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::QosFilter::TypeOfService) == 1, "wrong alignment");

    struct Ipv6FlowLabel final {
        enum class hidl_discriminator : uint8_t {
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            value = 1,  // uint32_t
        };

        Ipv6FlowLabel();
        ~Ipv6FlowLabel();
        Ipv6FlowLabel(Ipv6FlowLabel&&);
        Ipv6FlowLabel(const Ipv6FlowLabel&);
        Ipv6FlowLabel& operator=(Ipv6FlowLabel&&);
        Ipv6FlowLabel& operator=(const Ipv6FlowLabel&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void value(uint32_t);
        uint32_t& value();
        uint32_t value() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::radio::V1_6::QosFilter::Ipv6FlowLabel, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            uint32_t value __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::radio::V1_6::QosFilter::Ipv6FlowLabel::hidl_union) == 4, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_6::QosFilter::Ipv6FlowLabel::hidl_union) == 4, "wrong alignment");
        static_assert(sizeof(::android::hardware::radio::V1_6::QosFilter::Ipv6FlowLabel::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_6::QosFilter::Ipv6FlowLabel::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::radio::V1_6::QosFilter::Ipv6FlowLabel) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::QosFilter::Ipv6FlowLabel) == 4, "wrong alignment");

    struct IpsecSpi final {
        enum class hidl_discriminator : uint8_t {
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            value = 1,  // uint32_t
        };

        IpsecSpi();
        ~IpsecSpi();
        IpsecSpi(IpsecSpi&&);
        IpsecSpi(const IpsecSpi&);
        IpsecSpi& operator=(IpsecSpi&&);
        IpsecSpi& operator=(const IpsecSpi&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void value(uint32_t);
        uint32_t& value();
        uint32_t value() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::radio::V1_6::QosFilter::IpsecSpi, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            uint32_t value __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::radio::V1_6::QosFilter::IpsecSpi::hidl_union) == 4, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_6::QosFilter::IpsecSpi::hidl_union) == 4, "wrong alignment");
        static_assert(sizeof(::android::hardware::radio::V1_6::QosFilter::IpsecSpi::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_6::QosFilter::IpsecSpi::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::radio::V1_6::QosFilter::IpsecSpi) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::QosFilter::IpsecSpi) == 4, "wrong alignment");

    /**
     * Local and remote IP addresses, typically one IPv4 or one IPv6
     * or one of each. Addresses could be with optional "/" prefix
     * length, e.g.,"192.0.1.3" or "192.0.1.11/16 2001:db8::1/64".
     * If the prefix length is absent the addresses are assumed to be
     * point to point with IPv4 having a prefix length of 32 and
     * IPv6 128.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> localAddresses __attribute__ ((aligned(8)));
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> remoteAddresses __attribute__ ((aligned(8)));
    /**
     * Local and remote port/ranges
     */
    ::android::hardware::radio::V1_6::MaybePort localPort __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_6::MaybePort remotePort __attribute__ ((aligned(4)));
    /**
     * QoS protocol
     */
    ::android::hardware::radio::V1_6::QosProtocol protocol __attribute__ ((aligned(1)));
    /**
     * Type of service value or mask as defined in RFC 1349
     */
    ::android::hardware::radio::V1_6::QosFilter::TypeOfService tos __attribute__ ((aligned(1)));
    /**
     * IPv6 flow label as defined in RFC 6437
     */
    ::android::hardware::radio::V1_6::QosFilter::Ipv6FlowLabel flowLabel __attribute__ ((aligned(4)));
    /**
     * IPSec security parameter index
     */
    ::android::hardware::radio::V1_6::QosFilter::IpsecSpi spi __attribute__ ((aligned(4)));
    /**
     * Filter direction
     */
    ::android::hardware::radio::V1_6::QosFilterDirection direction __attribute__ ((aligned(1)));
    /**
     * Specifies the order in which the filter needs to be matched.
     * A lower numerical(positive) value has a higher precedence.
     * Set -1 when unspecified.
     */
    int32_t precedence __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::QosFilter, localAddresses) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::QosFilter, remoteAddresses) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::QosFilter, localPort) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::QosFilter, remotePort) == 44, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::QosFilter, protocol) == 56, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::QosFilter, tos) == 57, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::QosFilter, flowLabel) == 60, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::QosFilter, spi) == 68, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::QosFilter, direction) == 76, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::QosFilter, precedence) == 80, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::QosFilter) == 88, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::QosFilter) == 8, "wrong alignment");

/**
 * QOS session associated with a dedicated bearer
 */
struct QosSession final {
    /**
     * Unique ID of the QoS session within the data call
     */
    int32_t qosSessionId __attribute__ ((aligned(4)));
    /**
     * QOS attributes
     */
    ::android::hardware::radio::V1_6::Qos qos __attribute__ ((aligned(4)));
    /**
     * List of QOS filters associated with this session
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_6::QosFilter> qosFilters __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::QosSession, qosSessionId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::QosSession, qos) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::QosSession, qosFilters) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::QosSession) == 48, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::QosSession) == 8, "wrong alignment");

/**
 * The allowed failure modes on an IWLAN handover failure.
 */
enum class HandoverFailureMode : int8_t {
    /**
     * On data handover failure, fallback to the source data transport when the
     * fail cause is due to a hand off preference change.
     */
    LEGACY = 0,
    /**
     * On data handover failure, fallback to the source data transport.
     */
    DO_FALLBACK = 1,
    /**
     * On data handover failure, retry the handover instead of falling back to
     * the source data transport.
     */
    NO_FALLBACK_RETRY_HANDOVER = 2,
    /**
     * On data handover failure, setup a new data connection by sending a normal
     * request to the underlying data service.
     */
    NO_FALLBACK_RETRY_SETUP_NORMAL = 3,
};

/**
 * Expose more setup data call failures.
 */
enum class DataCallFailCause : int32_t {
    NONE = 0,
    OPERATOR_BARRED = 8 /* 0x08 */,
    NAS_SIGNALLING = 14 /* 0x0E */,
    INSUFFICIENT_RESOURCES = 26 /* 0x1A */,
    MISSING_UKNOWN_APN = 27 /* 0x1B */,
    UNKNOWN_PDP_ADDRESS_TYPE = 28 /* 0x1C */,
    USER_AUTHENTICATION = 29 /* 0x1D */,
    ACTIVATION_REJECT_GGSN = 30 /* 0x1E */,
    ACTIVATION_REJECT_UNSPECIFIED = 31 /* 0x1F */,
    SERVICE_OPTION_NOT_SUPPORTED = 32 /* 0x20 */,
    SERVICE_OPTION_NOT_SUBSCRIBED = 33 /* 0x21 */,
    SERVICE_OPTION_OUT_OF_ORDER = 34 /* 0x22 */,
    NSAPI_IN_USE = 35 /* 0x23 */,
    REGULAR_DEACTIVATION = 36 /* 0x24 */,
    QOS_NOT_ACCEPTED = 37 /* 0x25 */,
    NETWORK_FAILURE = 38 /* 0x26 */,
    UMTS_REACTIVATION_REQ = 39 /* 0x27 */,
    FEATURE_NOT_SUPP = 40 /* 0x28 */,
    TFT_SEMANTIC_ERROR = 41 /* 0x29 */,
    TFT_SYTAX_ERROR = 42 /* 0x2A */,
    UNKNOWN_PDP_CONTEXT = 43 /* 0x2B */,
    FILTER_SEMANTIC_ERROR = 44 /* 0x2C */,
    FILTER_SYTAX_ERROR = 45 /* 0x2D */,
    PDP_WITHOUT_ACTIVE_TFT = 46 /* 0x2E */,
    ONLY_IPV4_ALLOWED = 50 /* 0x32 */,
    ONLY_IPV6_ALLOWED = 51 /* 0x33 */,
    ONLY_SINGLE_BEARER_ALLOWED = 52 /* 0x34 */,
    ESM_INFO_NOT_RECEIVED = 53 /* 0x35 */,
    PDN_CONN_DOES_NOT_EXIST = 54 /* 0x36 */,
    MULTI_CONN_TO_SAME_PDN_NOT_ALLOWED = 55 /* 0x37 */,
    MAX_ACTIVE_PDP_CONTEXT_REACHED = 65 /* 0x41 */,
    UNSUPPORTED_APN_IN_CURRENT_PLMN = 66 /* 0x42 */,
    INVALID_TRANSACTION_ID = 81 /* 0x51 */,
    MESSAGE_INCORRECT_SEMANTIC = 95 /* 0x5F */,
    INVALID_MANDATORY_INFO = 96 /* 0x60 */,
    MESSAGE_TYPE_UNSUPPORTED = 97 /* 0x61 */,
    MSG_TYPE_NONCOMPATIBLE_STATE = 98 /* 0x62 */,
    UNKNOWN_INFO_ELEMENT = 99 /* 0x63 */,
    CONDITIONAL_IE_ERROR = 100 /* 0x64 */,
    MSG_AND_PROTOCOL_STATE_UNCOMPATIBLE = 101 /* 0x65 */,
    PROTOCOL_ERRORS = 111 /* 0x6F */,
    APN_TYPE_CONFLICT = 112 /* 0x70 */,
    INVALID_PCSCF_ADDR = 113 /* 0x71 */,
    INTERNAL_CALL_PREEMPT_BY_HIGH_PRIO_APN = 114 /* 0x72 */,
    EMM_ACCESS_BARRED = 115 /* 0x73 */,
    EMERGENCY_IFACE_ONLY = 116 /* 0x74 */,
    IFACE_MISMATCH = 117 /* 0x75 */,
    COMPANION_IFACE_IN_USE = 118 /* 0x76 */,
    IP_ADDRESS_MISMATCH = 119 /* 0x77 */,
    IFACE_AND_POL_FAMILY_MISMATCH = 120 /* 0x78 */,
    EMM_ACCESS_BARRED_INFINITE_RETRY = 121 /* 0x79 */,
    AUTH_FAILURE_ON_EMERGENCY_CALL = 122 /* 0x7A */,
    OEM_DCFAILCAUSE_1 = 4097 /* 0x1001 */,
    OEM_DCFAILCAUSE_2 = 4098 /* 0x1002 */,
    OEM_DCFAILCAUSE_3 = 4099 /* 0x1003 */,
    OEM_DCFAILCAUSE_4 = 4100 /* 0x1004 */,
    OEM_DCFAILCAUSE_5 = 4101 /* 0x1005 */,
    OEM_DCFAILCAUSE_6 = 4102 /* 0x1006 */,
    OEM_DCFAILCAUSE_7 = 4103 /* 0x1007 */,
    OEM_DCFAILCAUSE_8 = 4104 /* 0x1008 */,
    OEM_DCFAILCAUSE_9 = 4105 /* 0x1009 */,
    OEM_DCFAILCAUSE_10 = 4106 /* 0x100A */,
    OEM_DCFAILCAUSE_11 = 4107 /* 0x100B */,
    OEM_DCFAILCAUSE_12 = 4108 /* 0x100C */,
    OEM_DCFAILCAUSE_13 = 4109 /* 0x100D */,
    OEM_DCFAILCAUSE_14 = 4110 /* 0x100E */,
    OEM_DCFAILCAUSE_15 = 4111 /* 0x100F */,
    VOICE_REGISTRATION_FAIL = -1 /* -1 */,
    DATA_REGISTRATION_FAIL = -2 /* -2 */,
    SIGNAL_LOST = -3 /* -3 */,
    PREF_RADIO_TECH_CHANGED = -4 /* -4 */,
    RADIO_POWER_OFF = -5 /* -5 */,
    TETHERED_CALL_ACTIVE = -6 /* -6 */,
    ERROR_UNSPECIFIED = 65535 /* 0xffff */,
    /**
     * Network cannot provide the requested service and PDP context is deactivated because of LLC
     * or SNDCP failure.
     */
    LLC_SNDCP = 25 /* 0x19 */,
    /**
     * UE requested to modify QoS parameters or the bearer control mode, which is not compatible
     * with the selected bearer control mode.
     */
    ACTIVATION_REJECTED_BCM_VIOLATION = 48 /* 0x30 */,
    /**
     * Network has already initiated the activation, modification, or deactivation of bearer
     * resources that was requested by the UE.
     */
    COLLISION_WITH_NETWORK_INITIATED_REQUEST = 56 /* 0x38 */,
    /**
     * Network supports IPv4v6 PDP type only. Non-IP type is not allowed. In LTE mode of operation,
     * this is a PDN throttling cause code, meaning the UE may throttle further requests to the
     * same APN.
     */
    ONLY_IPV4V6_ALLOWED = 57 /* 0x39 */,
    /**
     * Network supports non-IP PDP type only. IPv4, IPv6 and IPv4v6 is not allowed. In LTE mode of
     * operation, this is a PDN throttling cause code, meaning the UE can throttle further requests
     * to the same APN.
     */
    ONLY_NON_IP_ALLOWED = 58 /* 0x3A */,
    /**
     * QCI (QoS Class Identifier) indicated in the UE request cannot be supported.
     */
    UNSUPPORTED_QCI_VALUE = 59 /* 0x3B */,
    /**
     * Procedure requested by the UE was rejected because the bearer handling is not supported.
     */
    BEARER_HANDLING_NOT_SUPPORTED = 60 /* 0x3C */,
    /**
     * Not receiving a DNS address that was mandatory.
     */
    INVALID_DNS_ADDR = 123 /* 0x7B */,
    /**
     * Not receiving either a PCSCF or a DNS address, one of them being mandatory.
     */
    INVALID_PCSCF_OR_DNS_ADDRESS = 124 /* 0x7C */,
    /**
     * Emergency call bring up on a different ePDG.
     */
    CALL_PREEMPT_BY_EMERGENCY_APN = 127 /* 0x7F */,
    /**
     * UE performs a detach or disconnect PDN action based on TE requirements.
     */
    UE_INITIATED_DETACH_OR_DISCONNECT = 128 /* 0x80 */,
    /**
     * Reason unspecified for foreign agent rejected MIP (Mobile IP) registration.
     */
    MIP_FA_REASON_UNSPECIFIED = 2000 /* 0x7D0 */,
    /**
     * Foreign agent administratively prohibited MIP (Mobile IP) registration.
     */
    MIP_FA_ADMIN_PROHIBITED = 2001 /* 0x7D1 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of insufficient resources.
     */
    MIP_FA_INSUFFICIENT_RESOURCES = 2002 /* 0x7D2 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of MN-AAA authenticator was
     * wrong.
     */
    MIP_FA_MOBILE_NODE_AUTHENTICATION_FAILURE = 2003 /* 0x7D3 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of home agent authentication
     * failure.
     */
    MIP_FA_HOME_AGENT_AUTHENTICATION_FAILURE = 2004 /* 0x7D4 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of requested lifetime was too
     * long.
     */
    MIP_FA_REQUESTED_LIFETIME_TOO_LONG = 2005 /* 0x7D5 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of malformed request.
     */
    MIP_FA_MALFORMED_REQUEST = 2006 /* 0x7D6 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of malformed reply.
     */
    MIP_FA_MALFORMED_REPLY = 2007 /* 0x7D7 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of requested encapsulation was
     * unavailable.
     */
    MIP_FA_ENCAPSULATION_UNAVAILABLE = 2008 /* 0x7D8 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration of VJ Header Compression was unavailable.
     */
    MIP_FA_VJ_HEADER_COMPRESSION_UNAVAILABLE = 2009 /* 0x7D9 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of reverse tunnel was
     * unavailable.
     */
    MIP_FA_REVERSE_TUNNEL_UNAVAILABLE = 2010 /* 0x7DA */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of reverse tunnel was mandatory
     * but not requested by device.
     */
    MIP_FA_REVERSE_TUNNEL_IS_MANDATORY = 2011 /* 0x7DB */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of delivery style was not
     * supported.
     */
    MIP_FA_DELIVERY_STYLE_NOT_SUPPORTED = 2012 /* 0x7DC */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of missing NAI (Network Access
     * Identifier).
     */
    MIP_FA_MISSING_NAI = 2013 /* 0x7DD */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of missing Home Agent.
     */
    MIP_FA_MISSING_HOME_AGENT = 2014 /* 0x7DE */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of missing Home Address.
     */
    MIP_FA_MISSING_HOME_ADDRESS = 2015 /* 0x7DF */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of unknown challenge.
     */
    MIP_FA_UNKNOWN_CHALLENGE = 2016 /* 0x7E0 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of missing challenge.
     */
    MIP_FA_MISSING_CHALLENGE = 2017 /* 0x7E1 */,
    /**
     * Foreign agent rejected MIP (Mobile IP) registration because of stale challenge.
     */
    MIP_FA_STALE_CHALLENGE = 2018 /* 0x7E2 */,
    /**
     * Reason unspecified for home agent rejected MIP (Mobile IP) registration.
     */
    MIP_HA_REASON_UNSPECIFIED = 2019 /* 0x7E3 */,
    /**
     * Home agent administratively prohibited MIP (Mobile IP) registration.
     */
    MIP_HA_ADMIN_PROHIBITED = 2020 /* 0x7E4 */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of insufficient resources.
     */
    MIP_HA_INSUFFICIENT_RESOURCES = 2021 /* 0x7E5 */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of MN-HA authenticator was wrong.
     */
    MIP_HA_MOBILE_NODE_AUTHENTICATION_FAILURE = 2022 /* 0x7E6 */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of foreign agent authentication
     * failure.
     */
    MIP_HA_FOREIGN_AGENT_AUTHENTICATION_FAILURE = 2023 /* 0x7E7 */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of registration id mismatch.
     */
    MIP_HA_REGISTRATION_ID_MISMATCH = 2024 /* 0x7E8 */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of malformed request.
     */
    MIP_HA_MALFORMED_REQUEST = 2025 /* 0x7E9 */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of unknown home agent address.
     */
    MIP_HA_UNKNOWN_HOME_AGENT_ADDRESS = 2026 /* 0x7EA */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of reverse tunnel was unavailable.
     */
    MIP_HA_REVERSE_TUNNEL_UNAVAILABLE = 2027 /* 0x7EB */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of reverse tunnel is mandatory but
     * not requested by device.
     */
    MIP_HA_REVERSE_TUNNEL_IS_MANDATORY = 2028 /* 0x7EC */,
    /**
     * Home agent rejected MIP (Mobile IP) registration because of encapsulation unavailable.
     */
    MIP_HA_ENCAPSULATION_UNAVAILABLE = 2029 /* 0x7ED */,
    /**
     * Tearing down is in progress.
     */
    CLOSE_IN_PROGRESS = 2030 /* 0x7EE */,
    /**
     * Brought down by the network.
     */
    NETWORK_INITIATED_TERMINATION = 2031 /* 0x7EF */,
    /**
     * Another application in modem preempts the data call.
     */
    MODEM_APP_PREEMPTED = 2032 /* 0x7F0 */,
    /**
     * IPV4 PDN is in throttled state due to network providing only IPV6 address during the previous
     * VSNCP bringup (subs_limited_to_v6).
     */
    PDN_IPV4_CALL_DISALLOWED = 2033 /* 0x7F1 */,
    /**
     * IPV4 PDN is in throttled state due to previous VSNCP bringup failure(s).
     */
    PDN_IPV4_CALL_THROTTLED = 2034 /* 0x7F2 */,
    /**
     * IPV6 PDN is in throttled state due to network providing only IPV4 address during the previous
     * VSNCP bringup (subs_limited_to_v4).
     */
    PDN_IPV6_CALL_DISALLOWED = 2035 /* 0x7F3 */,
    /**
     * IPV6 PDN is in throttled state due to previous VSNCP bringup failure(s).
     */
    PDN_IPV6_CALL_THROTTLED = 2036 /* 0x7F4 */,
    /**
     * Modem restart.
     */
    MODEM_RESTART = 2037 /* 0x7F5 */,
    /**
     * PDP PPP calls are not supported.
     */
    PDP_PPP_NOT_SUPPORTED = 2038 /* 0x7F6 */,
    /**
     * RAT on which the data call is attempted/connected is no longer the preferred RAT.
     */
    UNPREFERRED_RAT = 2039 /* 0x7F7 */,
    /**
     * Physical link is in the process of cleanup.
     */
    PHYSICAL_LINK_CLOSE_IN_PROGRESS = 2040 /* 0x7F8 */,
    /**
     * Interface bring up is attempted for an APN that is yet to be handed over to target RAT.
     */
    APN_PENDING_HANDOVER = 2041 /* 0x7F9 */,
    /**
     * APN bearer type in the profile does not match preferred network mode.
     */
    PROFILE_BEARER_INCOMPATIBLE = 2042 /* 0x7FA */,
    /**
     * Card was refreshed or removed.
     */
    SIM_CARD_CHANGED = 2043 /* 0x7FB */,
    /**
     * Device is going into lower power mode or powering down.
     */
    LOW_POWER_MODE_OR_POWERING_DOWN = 2044 /* 0x7FC */,
    /**
     * APN has been disabled.
     */
    APN_DISABLED = 2045 /* 0x7FD */,
    /**
     * Maximum PPP inactivity timer expired.
     */
    MAX_PPP_INACTIVITY_TIMER_EXPIRED = 2046 /* 0x7FE */,
    /**
     * IPv6 address transfer failed.
     */
    IPV6_ADDRESS_TRANSFER_FAILED = 2047 /* 0x7FF */,
    /**
     * Target RAT swap failed.
     */
    TRAT_SWAP_FAILED = 2048 /* 0x800 */,
    /**
     * Device falls back from eHRPD to HRPD.
     */
    EHRPD_TO_HRPD_FALLBACK = 2049 /* 0x801 */,
    /**
     * UE is in MIP-only configuration but the MIP configuration fails on call bring up due to
     * incorrect provisioning.
     */
    MIP_CONFIG_FAILURE = 2050 /* 0x802 */,
    /**
     * PDN inactivity timer expired due to no data transmission in a configurable duration of time.
     */
    PDN_INACTIVITY_TIMER_EXPIRED = 2051 /* 0x803 */,
    /**
     * IPv4 data call bring up is rejected because the UE already maintains the allotted maximum
     * number of IPv4 data connections.
     */
    MAX_IPV4_CONNECTIONS = 2052 /* 0x804 */,
    /**
     * IPv6 data call bring up is rejected because the UE already maintains the allotted maximum
     * number of IPv6 data connections.
     */
    MAX_IPV6_CONNECTIONS = 2053 /* 0x805 */,
    /**
     * New PDN bring up is rejected during interface selection because the UE has already allotted
     * the available interfaces for other PDNs.
     */
    APN_MISMATCH = 2054 /* 0x806 */,
    /**
     * New call bring up is rejected since the existing data call IP type doesn't match the
     * requested IP.
     */
    IP_VERSION_MISMATCH = 2055 /* 0x807 */,
    /**
     * Dial up networking (DUN) call bring up is rejected since UE is in eHRPD RAT.
     */
    DUN_CALL_DISALLOWED = 2056 /* 0x808 */,
    /**
     * Rejected/Brought down since UE is transition between EPC and NONEPC RAT.
     */
    INTERNAL_EPC_NONEPC_TRANSITION = 2057 /* 0x809 */,
    /**
     * The current interface is being in use.
     */
    INTERFACE_IN_USE = 2058 /* 0x80A */,
    /**
     * PDN connection to the APN is disallowed on the roaming network.
     */
    APN_DISALLOWED_ON_ROAMING = 2059 /* 0x80B */,
    /**
     * APN-related parameters are changed.
     */
    APN_PARAMETERS_CHANGED = 2060 /* 0x80C */,
    /**
     * PDN is attempted to be brought up with NULL APN but NULL APN is not supported.
     */
    NULL_APN_DISALLOWED = 2061 /* 0x80D */,
    /**
     * Thermal level increases and causes calls to be torn down when normal mode of operation is
     * not allowed.
     */
    THERMAL_MITIGATION = 2062 /* 0x80E */,
    /**
     * PDN Connection to a given APN is disallowed because data is disabled from the device user
     * interface settings.
     */
    DATA_SETTINGS_DISABLED = 2063 /* 0x80F */,
    /**
     * PDN Connection to a given APN is disallowed because data roaming is disabled from the device
     * user interface settings and the UE is roaming.
     */
    DATA_ROAMING_SETTINGS_DISABLED = 2064 /* 0x810 */,
    /**
     * DDS (Default data subscription) switch occurs.
     */
    DDS_SWITCHED = 2065 /* 0x811 */,
    /**
     * PDN being brought up with an APN that is part of forbidden APN Name list.
     */
    FORBIDDEN_APN_NAME = 2066 /* 0x812 */,
    /**
     * Default data subscription switch is in progress.
     */
    DDS_SWITCH_IN_PROGRESS = 2067 /* 0x813 */,
    /**
     * Roaming is disallowed during call bring up.
     */
    CALL_DISALLOWED_IN_ROAMING = 2068 /* 0x814 */,
    /**
     * UE is unable to bring up a non-IP data call because the device is not camped on a NB1 cell.
     */
    NON_IP_NOT_SUPPORTED = 2069 /* 0x815 */,
    /**
     * Non-IP PDN is in throttled state due to previous VSNCP bringup failure(s).
     */
    PDN_NON_IP_CALL_THROTTLED = 2070 /* 0x816 */,
    /**
     * Non-IP PDN is in disallowed state due to the network providing only an IP address.
     */
    PDN_NON_IP_CALL_DISALLOWED = 2071 /* 0x817 */,
    /**
     * Device in CDMA locked state.
     */
    CDMA_LOCK = 2072 /* 0x818 */,
    /**
     * Received an intercept order from the base station.
     */
    CDMA_INTERCEPT = 2073 /* 0x819 */,
    /**
     * Receiving a reorder from the base station.
     */
    CDMA_REORDER = 2074 /* 0x81A */,
    /**
     * Receiving a release from the base station with a SO (Service Option) Reject reason.
     */
    CDMA_RELEASE_DUE_TO_SO_REJECTION = 2075 /* 0x81B */,
    /**
     * Receiving an incoming call from the base station.
     */
    CDMA_INCOMING_CALL = 2076 /* 0x81C */,
    /**
     * Received an alert stop from the base station due to incoming only.
     */
    CDMA_ALERT_STOP = 2077 /* 0x81D */,
    /**
     * Channel acquisition failures. This indicates that device has failed acquiring all the
     * channels in the PRL.
     */
    CHANNEL_ACQUISITION_FAILURE = 2078 /* 0x81E */,
    /**
     * Maximum access probes transmitted.
     */
    MAX_ACCESS_PROBE = 2079 /* 0x81F */,
    /**
     * Concurrent service is not supported by base station.
     */
    CONCURRENT_SERVICE_NOT_SUPPORTED_BY_BASE_STATION = 2080 /* 0x820 */,
    /**
     * There was no response received from the base station.
     */
    NO_RESPONSE_FROM_BASE_STATION = 2081 /* 0x821 */,
    /**
     * The base station rejecting the call.
     */
    REJECTED_BY_BASE_STATION = 2082 /* 0x822 */,
    /**
     * The concurrent services requested were not compatible.
     */
    CONCURRENT_SERVICES_INCOMPATIBLE = 2083 /* 0x823 */,
    /**
     * Device does not have CDMA service.
     */
    NO_CDMA_SERVICE = 2084 /* 0x824 */,
    /**
     * RUIM not being present.
     */
    RUIM_NOT_PRESENT = 2085 /* 0x825 */,
    /**
     * Receiving a retry order from the base station.
     */
    CDMA_RETRY_ORDER = 2086 /* 0x826 */,
    /**
     * Access blocked by the base station.
     */
    ACCESS_BLOCK = 2087 /* 0x827 */,
    /**
     * Access blocked by the base station for all mobile devices.
     */
    ACCESS_BLOCK_ALL = 2088 /* 0x828 */,
    /**
     * Maximum access probes for the IS-707B call.
     */
    IS707B_MAX_ACCESS_PROBES = 2089 /* 0x829 */,
    /**
     * Put device in thermal emergency.
     */
    THERMAL_EMERGENCY = 2090 /* 0x82A */,
    /**
     * In favor of a voice call or SMS when concurrent voice and data are not supported.
     */
    CONCURRENT_SERVICES_NOT_ALLOWED = 2091 /* 0x82B */,
    /**
     * The other clients rejected incoming call.
     */
    INCOMING_CALL_REJECTED = 2092 /* 0x82C */,
    /**
     * No service on the gateway.
     */
    NO_SERVICE_ON_GATEWAY = 2093 /* 0x82D */,
    /**
     * GPRS context is not available.
     */
    NO_GPRS_CONTEXT = 2094 /* 0x82E */,
    /**
     * Network refuses service to the MS because either an identity of the MS is not acceptable to
     * the network or the MS does not pass the authentication check.
     */
    ILLEGAL_MS = 2095 /* 0x82F */,
    /**
     * ME could not be authenticated and the ME used is not acceptable to the network.
     */
    ILLEGAL_ME = 2096 /* 0x830 */,
    /**
     * Not allowed to operate either GPRS or non-GPRS services.
     */
    GPRS_SERVICES_AND_NON_GPRS_SERVICES_NOT_ALLOWED = 2097 /* 0x831 */,
    /**
     * MS is not allowed to operate GPRS services.
     */
    GPRS_SERVICES_NOT_ALLOWED = 2098 /* 0x832 */,
    /**
     * No matching identity or context could be found in the network.
     */
    MS_IDENTITY_CANNOT_BE_DERIVED_BY_THE_NETWORK = 2099 /* 0x833 */,
    /**
     * Mobile reachable timer has expired, or the GMM context data related to the subscription does
     * not exist in the SGSN.
     */
    IMPLICITLY_DETACHED = 2100 /* 0x834 */,
    /**
     * UE requests GPRS service, or the network initiates a detach request in a PLMN which does not
     * offer roaming for GPRS services to that MS.
     */
    PLMN_NOT_ALLOWED = 2101 /* 0x835 */,
    /**
     * MS requests service, or the network initiates a detach request, in a location area where the
     * HPLMN determines that the MS, by subscription, is not allowed to operate.
     */
    LOCATION_AREA_NOT_ALLOWED = 2102 /* 0x836 */,
    /**
     * UE requests GPRS service or the network initiates a detach request in a PLMN that does not
     * offer roaming for GPRS services.
     */
    GPRS_SERVICES_NOT_ALLOWED_IN_THIS_PLMN = 2103 /* 0x837 */,
    /**
     * PDP context already exists.
     */
    PDP_DUPLICATE = 2104 /* 0x838 */,
    /**
     * RAT change on the UE.
     */
    UE_RAT_CHANGE = 2105 /* 0x839 */,
    /**
     * Network cannot serve a request from the MS due to congestion.
     */
    CONGESTION = 2106 /* 0x83A */,
    /**
     * MS requests an establishment of the radio access bearers for all active PDP contexts by
     * sending a service request message indicating data to the network, but the SGSN does not have
     * any active PDP context.
     */
    NO_PDP_CONTEXT_ACTIVATED = 2107 /* 0x83B */,
    /**
     * Access class blocking restrictions for the current camped cell.
     */
    ACCESS_CLASS_DSAC_REJECTION = 2108 /* 0x83C */,
    /**
     * SM attempts PDP activation for a maximum of four attempts.
     */
    PDP_ACTIVATE_MAX_RETRY_FAILED = 2109 /* 0x83D */,
    /**
     * Radio access bearer failure.
     */
    RADIO_ACCESS_BEARER_FAILURE = 2110 /* 0x83E */,
    /**
     * Invalid EPS bearer identity in the request.
     */
    ESM_UNKNOWN_EPS_BEARER_CONTEXT = 2111 /* 0x83F */,
    /**
     * Data radio bearer is released by the RRC.
     */
    DRB_RELEASED_BY_RRC = 2112 /* 0x840 */,
    /**
     * Indicate the connection was released.
     */
    CONNECTION_RELEASED = 2113 /* 0x841 */,
    /**
     * UE is detached.
     */
    EMM_DETACHED = 2114 /* 0x842 */,
    /**
     * Attach procedure is rejected by the network.
     */
    EMM_ATTACH_FAILED = 2115 /* 0x843 */,
    /**
     * Attach procedure is started for EMC purposes.
     */
    EMM_ATTACH_STARTED = 2116 /* 0x844 */,
    /**
     * Service request procedure failure.
     */
    LTE_NAS_SERVICE_REQUEST_FAILED = 2117 /* 0x845 */,
    /**
     * Active dedicated bearer was requested using the same default bearer ID.
     */
    DUPLICATE_BEARER_ID = 2118 /* 0x846 */,
    /**
     * Collision scenarios for the UE and network-initiated procedures.
     */
    ESM_COLLISION_SCENARIOS = 2119 /* 0x847 */,
    /**
     * Bearer must be deactivated to synchronize with the network.
     */
    ESM_BEARER_DEACTIVATED_TO_SYNC_WITH_NETWORK = 2120 /* 0x848 */,
    /**
     * Active dedicated bearer was requested for an existing default bearer.
     */
    ESM_NW_ACTIVATED_DED_BEARER_WITH_ID_OF_DEF_BEARER = 2121 /* 0x849 */,
    /**
     * Bad OTA message is received from the network.
     */
    ESM_BAD_OTA_MESSAGE = 2122 /* 0x84A */,
    /**
     * Download server rejected the call.
     */
    ESM_DOWNLOAD_SERVER_REJECTED_THE_CALL = 2123 /* 0x84B */,
    /**
     * PDN was disconnected by the downlaod server due to IRAT.
     */
    ESM_CONTEXT_TRANSFERRED_DUE_TO_IRAT = 2124 /* 0x84C */,
    /**
     * Dedicated bearer will be deactivated regardless of the network response.
     */
    DS_EXPLICIT_DEACTIVATION = 2125 /* 0x84D */,
    /**
     * No specific local cause is mentioned, usually a valid OTA cause.
     */
    ESM_LOCAL_CAUSE_NONE = 2126 /* 0x84E */,
    /**
     * Throttling is not needed for this service request failure.
     */
    LTE_THROTTLING_NOT_REQUIRED = 2127 /* 0x84F */,
    /**
     * Access control list check failure at the lower layer.
     */
    ACCESS_CONTROL_LIST_CHECK_FAILURE = 2128 /* 0x850 */,
    /**
     * Service is not allowed on the requested PLMN.
     */
    SERVICE_NOT_ALLOWED_ON_PLMN = 2129 /* 0x851 */,
    /**
     * T3417 timer expiration of the service request procedure.
     */
    EMM_T3417_EXPIRED = 2130 /* 0x852 */,
    /**
     * Extended service request fails due to expiration of the T3417 EXT timer.
     */
    EMM_T3417_EXT_EXPIRED = 2131 /* 0x853 */,
    /**
     * Transmission failure of radio resource control (RRC) uplink data.
     */
    RRC_UPLINK_DATA_TRANSMISSION_FAILURE = 2132 /* 0x854 */,
    /**
     * Radio resource control (RRC) uplink data delivery failed due to a handover.
     */
    RRC_UPLINK_DELIVERY_FAILED_DUE_TO_HANDOVER = 2133 /* 0x855 */,
    /**
     * Radio resource control (RRC) uplink data delivery failed due to a connection release.
     */
    RRC_UPLINK_CONNECTION_RELEASE = 2134 /* 0x856 */,
    /**
     * Radio resource control (RRC) uplink data delivery failed due to a radio link failure.
     */
    RRC_UPLINK_RADIO_LINK_FAILURE = 2135 /* 0x857 */,
    /**
     * Radio resource control (RRC) is not connected but the non-access stratum (NAS) sends an
     * uplink data request.
     */
    RRC_UPLINK_ERROR_REQUEST_FROM_NAS = 2136 /* 0x858 */,
    /**
     * Radio resource control (RRC) connection failure at access stratum.
     */
    RRC_CONNECTION_ACCESS_STRATUM_FAILURE = 2137 /* 0x859 */,
    /**
     * Radio resource control (RRC) connection establishment is aborted due to another procedure.
     */
    RRC_CONNECTION_ANOTHER_PROCEDURE_IN_PROGRESS = 2138 /* 0x85A */,
    /**
     * Radio resource control (RRC) connection establishment failed due to access barrred.
     */
    RRC_CONNECTION_ACCESS_BARRED = 2139 /* 0x85B */,
    /**
     * Radio resource control (RRC) connection establishment failed due to cell reselection at
     * access stratum.
     */
    RRC_CONNECTION_CELL_RESELECTION = 2140 /* 0x85C */,
    /**
     * Connection establishment failed due to configuration failure at the radio resource control
     * (RRC).
     */
    RRC_CONNECTION_CONFIG_FAILURE = 2141 /* 0x85D */,
    /**
     * Radio resource control (RRC) connection could not be established in the time limit.
     */
    RRC_CONNECTION_TIMER_EXPIRED = 2142 /* 0x85E */,
    /**
     * Connection establishment failed due to a link failure at the radio resource control (RRC).
     */
    RRC_CONNECTION_LINK_FAILURE = 2143 /* 0x85F */,
    /**
     * Connection establishment failed as the radio resource control (RRC) is not camped on any
     * cell.
     */
    RRC_CONNECTION_CELL_NOT_CAMPED = 2144 /* 0x860 */,
    /**
     * Connection establishment failed due to a service interval failure at the radio resource
     * control (RRC).
     */
    RRC_CONNECTION_SYSTEM_INTERVAL_FAILURE = 2145 /* 0x861 */,
    /**
     * Radio resource control (RRC) connection establishment failed due to the network rejecting the
     * UE connection request.
     */
    RRC_CONNECTION_REJECT_BY_NETWORK = 2146 /* 0x862 */,
    /**
     * Normal radio resource control (RRC) connection release.
     */
    RRC_CONNECTION_NORMAL_RELEASE = 2147 /* 0x863 */,
    /**
     * Radio resource control (RRC) connection release failed due to radio link failure conditions.
     */
    RRC_CONNECTION_RADIO_LINK_FAILURE = 2148 /* 0x864 */,
    /**
     * Radio resource control (RRC) connection re-establishment failure.
     */
    RRC_CONNECTION_REESTABLISHMENT_FAILURE = 2149 /* 0x865 */,
    /**
     * UE is out of service during the call register.
     */
    RRC_CONNECTION_OUT_OF_SERVICE_DURING_CELL_REGISTER = 2150 /* 0x866 */,
    /**
     * Connection has been released by the radio resource control (RRC) due to an abort request.
     */
    RRC_CONNECTION_ABORT_REQUEST = 2151 /* 0x867 */,
    /**
     * Radio resource control (RRC) connection released due to a system information block read
     * error.
     */
    RRC_CONNECTION_SYSTEM_INFORMATION_BLOCK_READ_ERROR = 2152 /* 0x868 */,
    /**
     * Network-initiated detach with reattach.
     */
    NETWORK_INITIATED_DETACH_WITH_AUTO_REATTACH = 2153 /* 0x869 */,
    /**
     * Network-initiated detach without reattach.
     */
    NETWORK_INITIATED_DETACH_NO_AUTO_REATTACH = 2154 /* 0x86A */,
    /**
     * ESM procedure maximum attempt timeout failure.
     */
    ESM_PROCEDURE_TIME_OUT = 2155 /* 0x86B */,
    /**
     * No PDP exists with the given connection ID while modifying or deactivating or activation for
     * an already active PDP.
     */
    INVALID_CONNECTION_ID = 2156 /* 0x86C */,
    /**
     * Maximum NSAPIs have been exceeded during PDP activation.
     */
    MAXIMIUM_NSAPIS_EXCEEDED = 2157 /* 0x86D */,
    /**
     * Primary context for NSAPI does not exist.
     */
    INVALID_PRIMARY_NSAPI = 2158 /* 0x86E */,
    /**
     * Unable to encode the OTA message for MT PDP or deactivate PDP.
     */
    CANNOT_ENCODE_OTA_MESSAGE = 2159 /* 0x86F */,
    /**
     * Radio access bearer is not established by the lower layers during activation, modification,
     * or deactivation.
     */
    RADIO_ACCESS_BEARER_SETUP_FAILURE = 2160 /* 0x870 */,
    /**
     * Expiration of the PDP establish timer with a maximum of five retries.
     */
    PDP_ESTABLISH_TIMEOUT_EXPIRED = 2161 /* 0x871 */,
    /**
     * Expiration of the PDP modify timer with a maximum of four retries.
     */
    PDP_MODIFY_TIMEOUT_EXPIRED = 2162 /* 0x872 */,
    /**
     * Expiration of the PDP deactivate timer with a maximum of four retries.
     */
    PDP_INACTIVE_TIMEOUT_EXPIRED = 2163 /* 0x873 */,
    /**
     * PDP activation failed due to RRC_ABORT or a forbidden PLMN.
     */
    PDP_LOWERLAYER_ERROR = 2164 /* 0x874 */,
    /**
     * MO PDP modify collision when the MT PDP is already in progress.
     */
    PDP_MODIFY_COLLISION = 2165 /* 0x875 */,
    /**
     * Maximum size of the L2 message was exceeded.
     */
    MAXINUM_SIZE_OF_L2_MESSAGE_EXCEEDED = 2166 /* 0x876 */,
    /**
     * Non-access stratum (NAS) request was rejected by the network.
     */
    NAS_REQUEST_REJECTED_BY_NETWORK = 2167 /* 0x877 */,
    /**
     * Radio resource control (RRC) connection establishment failure due to an error in the request
     * message.
     */
    RRC_CONNECTION_INVALID_REQUEST = 2168 /* 0x878 */,
    /**
     * Radio resource control (RRC) connection establishment failure due to a change in the tracking
     * area ID.
     */
    RRC_CONNECTION_TRACKING_AREA_ID_CHANGED = 2169 /* 0x879 */,
    /**
     * Radio resource control (RRC) connection establishment failure due to the RF was unavailable.
     */
    RRC_CONNECTION_RF_UNAVAILABLE = 2170 /* 0x87A */,
    /**
     * Radio resource control (RRC) connection was aborted before deactivating the LTE stack due to
     * a successful LTE to WCDMA/GSM/TD-SCDMA IRAT change.
     */
    RRC_CONNECTION_ABORTED_DUE_TO_IRAT_CHANGE = 2171 /* 0x87B */,
    /**
     * If the UE has an LTE radio link failure before security is established, the radio resource
     * control (RRC) connection must be released and the UE must return to idle.
     */
    RRC_CONNECTION_RELEASED_SECURITY_NOT_ACTIVE = 2172 /* 0x87C */,
    /**
     * Radio resource control (RRC) connection was aborted by the non-access stratum (NAS) after an
     * IRAT to LTE IRAT handover.
     */
    RRC_CONNECTION_ABORTED_AFTER_HANDOVER = 2173 /* 0x87D */,
    /**
     * Radio resource control (RRC) connection was aborted before deactivating the LTE stack after a
     * successful LTE to GSM/EDGE IRAT cell change order procedure.
     */
    RRC_CONNECTION_ABORTED_AFTER_IRAT_CELL_CHANGE = 2174 /* 0x87E */,
    /**
     * Radio resource control (RRC) connection was aborted in the middle of a LTE to GSM IRAT cell
     * change order procedure.
     */
    RRC_CONNECTION_ABORTED_DURING_IRAT_CELL_CHANGE = 2175 /* 0x87F */,
    /**
     * IMSI present in the UE is unknown in the home subscriber server.
     */
    IMSI_UNKNOWN_IN_HOME_SUBSCRIBER_SERVER = 2176 /* 0x880 */,
    /**
     * IMEI of the UE is not accepted by the network.
     */
    IMEI_NOT_ACCEPTED = 2177 /* 0x881 */,
    /**
     * EPS and non-EPS services are not allowed by the network.
     */
    EPS_SERVICES_AND_NON_EPS_SERVICES_NOT_ALLOWED = 2178 /* 0x882 */,
    /**
     * EPS services are not allowed in the PLMN.
     */
    EPS_SERVICES_NOT_ALLOWED_IN_PLMN = 2179 /* 0x883 */,
    /**
     * Mobile switching center is temporarily unreachable.
     */
    MSC_TEMPORARILY_NOT_REACHABLE = 2180 /* 0x884 */,
    /**
     * CS domain is not available.
     */
    CS_DOMAIN_NOT_AVAILABLE = 2181 /* 0x885 */,
    /**
     * ESM level failure.
     */
    ESM_FAILURE = 2182 /* 0x886 */,
    /**
     * MAC level failure.
     */
    MAC_FAILURE = 2183 /* 0x887 */,
    /**
     * Synchronization failure.
     */
    SYNCHRONIZATION_FAILURE = 2184 /* 0x888 */,
    /**
     * UE security capabilities mismatch.
     */
    UE_SECURITY_CAPABILITIES_MISMATCH = 2185 /* 0x889 */,
    /**
     * Unspecified security mode reject.
     */
    SECURITY_MODE_REJECTED = 2186 /* 0x88A */,
    /**
     * Unacceptable non-EPS authentication.
     */
    UNACCEPTABLE_NON_EPS_AUTHENTICATION = 2187 /* 0x88B */,
    /**
     * CS fallback call establishment is not allowed.
     */
    CS_FALLBACK_CALL_ESTABLISHMENT_NOT_ALLOWED = 2188 /* 0x88C */,
    /**
     * No EPS bearer context was activated.
     */
    NO_EPS_BEARER_CONTEXT_ACTIVATED = 2189 /* 0x88D */,
    /**
     * Invalid EMM state.
     */
    INVALID_EMM_STATE = 2190 /* 0x88E */,
    /**
     * Non-Access Spectrum layer failure.
     */
    NAS_LAYER_FAILURE = 2191 /* 0x88F */,
    /**
     * Multiple PDP call feature is disabled.
     */
    MULTIPLE_PDP_CALL_NOT_ALLOWED = 2192 /* 0x890 */,
    /**
     * Data call was unsuccessfully transferred during the IRAT handover.
     */
    IRAT_HANDOVER_FAILED = 2194 /* 0x892 */,
    /**
     * Test loop-back data call has been successfully brought down.
     */
    TEST_LOOPBACK_REGULAR_DEACTIVATION = 2196 /* 0x894 */,
    /**
     * Lower layer registration failure.
     */
    LOWER_LAYER_REGISTRATION_FAILURE = 2197 /* 0x895 */,
    /**
     * Network initiates a detach on LTE with error cause "data plan has been replenished or has
     * expired".
     */
    DATA_PLAN_EXPIRED = 2198 /* 0x896 */,
    /**
     * UMTS interface is brought down due to handover from UMTS to iWLAN.
     */
    UMTS_HANDOVER_TO_IWLAN = 2199 /* 0x897 */,
    /**
     * Received a connection deny due to general or network busy on EVDO network.
     */
    EVDO_CONNECTION_DENY_BY_GENERAL_OR_NETWORK_BUSY = 2200 /* 0x898 */,
    /**
     * Received a connection deny due to billing or authentication failure on EVDO network.
     */
    EVDO_CONNECTION_DENY_BY_BILLING_OR_AUTHENTICATION_FAILURE = 2201 /* 0x899 */,
    /**
     * HDR system has been changed due to redirection or the PRL was not preferred.
     */
    EVDO_HDR_CHANGED = 2202 /* 0x89A */,
    /**
     * Device exited HDR due to redirection or the PRL was not preferred.
     */
    EVDO_HDR_EXITED = 2203 /* 0x89B */,
    /**
     * Device does not have an HDR session.
     */
    EVDO_HDR_NO_SESSION = 2204 /* 0x89C */,
    /**
     * It is ending an HDR call origination in favor of a GPS fix.
     */
    EVDO_USING_GPS_FIX_INSTEAD_OF_HDR_CALL = 2205 /* 0x89D */,
    /**
     * Connection setup on the HDR system was time out.
     */
    EVDO_HDR_CONNECTION_SETUP_TIMEOUT = 2206 /* 0x89E */,
    /**
     * Device failed to acquire a co-located HDR for origination.
     */
    FAILED_TO_ACQUIRE_COLOCATED_HDR = 2207 /* 0x89F */,
    /**
     * OTASP commit is in progress.
     */
    OTASP_COMMIT_IN_PROGRESS = 2208 /* 0x8A0 */,
    /**
     * Device has no hybrid HDR service.
     */
    NO_HYBRID_HDR_SERVICE = 2209 /* 0x8A1 */,
    /**
     * HDR module could not be obtained because of the RF locked.
     */
    HDR_NO_LOCK_GRANTED = 2210 /* 0x8A2 */,
    /**
     * DBM or SMS is in progress.
     */
    DBM_OR_SMS_IN_PROGRESS = 2211 /* 0x8A3 */,
    /**
     * HDR module released the call due to fade.
     */
    HDR_FADE = 2212 /* 0x8A4 */,
    /**
     * HDR system access failure.
     */
    HDR_ACCESS_FAILURE = 2213 /* 0x8A5 */,
    /**
     * P_rev supported by 1 base station is less than 6, which is not supported for a 1X data call.
     * The UE must be in the footprint of BS which has p_rev >= 6 to support this SO33 call.
     */
    UNSUPPORTED_1X_PREV = 2214 /* 0x8A6 */,
    /**
     * Client ended the data call.
     */
    LOCAL_END = 2215 /* 0x8A7 */,
    /**
     * Device has no service.
     */
    NO_SERVICE = 2216 /* 0x8A8 */,
    /**
     * Device lost the system due to fade.
     */
    FADE = 2217 /* 0x8A9 */,
    /**
     * Receiving a release from the base station with no reason.
     */
    NORMAL_RELEASE = 2218 /* 0x8AA */,
    /**
     * Access attempt is already in progress.
     */
    ACCESS_ATTEMPT_ALREADY_IN_PROGRESS = 2219 /* 0x8AB */,
    /**
     * Device is in the process of redirecting or handing off to a different target system.
     */
    REDIRECTION_OR_HANDOFF_IN_PROGRESS = 2220 /* 0x8AC */,
    /**
     * Device is operating in Emergency mode.
     */
    EMERGENCY_MODE = 2221 /* 0x8AD */,
    /**
     * Device is in use (e.g., voice call).
     */
    PHONE_IN_USE = 2222 /* 0x8AE */,
    /**
     * Device operational mode is different from the mode requested in the traffic channel bring up.
     */
    INVALID_MODE = 2223 /* 0x8AF */,
    /**
     * SIM was marked by the network as invalid for the circuit and/or packet service domain.
     */
    INVALID_SIM_STATE = 2224 /* 0x8B0 */,
    /**
     * There is no co-located HDR.
     */
    NO_COLLOCATED_HDR = 2225 /* 0x8B1 */,
    /**
     * UE is entering power save mode.
     */
    UE_IS_ENTERING_POWERSAVE_MODE = 2226 /* 0x8B2 */,
    /**
     * Dual switch from single standby to dual standby is in progress.
     */
    DUAL_SWITCH = 2227 /* 0x8B3 */,
    /**
     * Data call bring up fails in the PPP setup due to a timeout. (e.g., an LCP conf ack was not
     * received from the network)
     */
    PPP_TIMEOUT = 2228 /* 0x8B4 */,
    /**
     * Data call bring up fails in the PPP setup due to an authorization failure.
     * (e.g., authorization is required, but not negotiated with the network during an LCP phase)
     */
    PPP_AUTH_FAILURE = 2229 /* 0x8B5 */,
    /**
     * Data call bring up fails in the PPP setup due to an option mismatch.
     */
    PPP_OPTION_MISMATCH = 2230 /* 0x8B6 */,
    /**
     * Data call bring up fails in the PPP setup due to a PAP failure.
     */
    PPP_PAP_FAILURE = 2231 /* 0x8B7 */,
    /**
     * Data call bring up fails in the PPP setup due to a CHAP failure.
     */
    PPP_CHAP_FAILURE = 2232 /* 0x8B8 */,
    /**
     * Data call bring up fails in the PPP setup because the PPP is in the process of cleaning the
     * previous PPP session.
     */
    PPP_CLOSE_IN_PROGRESS = 2233 /* 0x8B9 */,
    /**
     * IPv6 interface bring up fails because the network provided only the IPv4 address for the
     * upcoming PDN permanent client can reattempt a IPv6 call bring up after the IPv4 interface is
     * also brought down. However, there is no guarantee that the network will provide a IPv6
     * address.
     */
    LIMITED_TO_IPV4 = 2234 /* 0x8BA */,
    /**
     * IPv4 interface bring up fails because the network provided only the IPv6 address for the
     * upcoming PDN permanent client can reattempt a IPv4 call bring up after the IPv6 interface is
     * also brought down. However there is no guarantee that the network will provide a IPv4
     * address.
     */
    LIMITED_TO_IPV6 = 2235 /* 0x8BB */,
    /**
     * Data call bring up fails in the VSNCP phase due to a VSNCP timeout error.
     */
    VSNCP_TIMEOUT = 2236 /* 0x8BC */,
    /**
     * Data call bring up fails in the VSNCP phase due to a general error. It's used when there is
     * no other specific error code available to report the failure.
     */
    VSNCP_GEN_ERROR = 2237 /* 0x8BD */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request because the requested APN is unauthorized.
     */
    VSNCP_APN_UNATHORIZED = 2238 /* 0x8BE */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request because the PDN limit has been exceeded.
     */
    VSNCP_PDN_LIMIT_EXCEEDED = 2239 /* 0x8BF */,
    /**
     * Data call bring up fails in the VSNCP phase due to the network rejected the VSNCP
     * configuration request due to no PDN gateway address.
     */
    VSNCP_NO_PDN_GATEWAY_ADDRESS = 2240 /* 0x8C0 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request because the PDN gateway is unreachable.
     */
    VSNCP_PDN_GATEWAY_UNREACHABLE = 2241 /* 0x8C1 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request due to a PDN gateway reject.
     */
    VSNCP_PDN_GATEWAY_REJECT = 2242 /* 0x8C2 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request with the reason of insufficient parameter.
     */
    VSNCP_INSUFFICIENT_PARAMETERS = 2243 /* 0x8C3 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request with the reason of resource unavailable.
     */
    VSNCP_RESOURCE_UNAVAILABLE = 2244 /* 0x8C4 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request with the reason of administratively prohibited at the HSGW.
     */
    VSNCP_ADMINISTRATIVELY_PROHIBITED = 2245 /* 0x8C5 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of PDN ID in use, or
     * all existing PDNs are brought down with this end reason because one of the PDN bring up was
     * rejected by the network with the reason of PDN ID in use.
     */
    VSNCP_PDN_ID_IN_USE = 2246 /* 0x8C6 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request for the reason of subscriber limitation.
     */
    VSNCP_SUBSCRIBER_LIMITATION = 2247 /* 0x8C7 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request because the PDN exists for this APN.
     */
    VSNCP_PDN_EXISTS_FOR_THIS_APN = 2248 /* 0x8C8 */,
    /**
     * Data call bring up fails in the VSNCP phase due to a network rejection of the VSNCP
     * configuration request with reconnect to this PDN not allowed, or an active data call is
     * terminated by the network because reconnection to this PDN is not allowed. Upon receiving
     * this error code from the network, the modem infinitely throttles the PDN until the next power
     * cycle.
     */
    VSNCP_RECONNECT_NOT_ALLOWED = 2249 /* 0x8C9 */,
    /**
     * Device failure to obtain the prefix from the network.
     */
    IPV6_PREFIX_UNAVAILABLE = 2250 /* 0x8CA */,
    /**
     * System preference change back to SRAT during handoff
     */
    HANDOFF_PREFERENCE_CHANGED = 2251 /* 0x8CB */,
    /**
     * Data call fail due to the slice not being allowed for the data call.
     */
    SLICE_REJECTED = 2252 /* 0x8CC */,
    /**
     * No matching rule available for the request, and match-all rule is not allowed for it.
     */
    MATCH_ALL_RULE_NOT_ALLOWED = 2253 /* 0x8CD */,
    /**
     * If connection failed for all matching URSP rules.
     */
    ALL_MATCHING_RULES_FAILED = 2254 /* 0x8CE */,
};

/**
 * Slice/Service Type as defined in 3GPP TS 23.501.
 */
enum class SliceServiceType : uint8_t {
    /*
     * Not specified
     */
    NONE = 0,
    /*
     * Slice suitable for the handling of 5G enhanced Mobile Broadband
     */
    EMBB = 1,
    /**
     * Slice suitable for the handling of ultra-reliable low latency
     * communications
     */
    URLLC = 2,
    /*
     * Slice suitable for the handling of massive IoT
     */
    MIOT = 3,
};

enum class SliceStatus : int8_t {
    UNKNOWN = 0,
    CONFIGURED = 1 /* ::android::hardware::radio::V1_6::SliceStatus.UNKNOWN implicitly + 1 */,
    ALLOWED = 2 /* ::android::hardware::radio::V1_6::SliceStatus.CONFIGURED implicitly + 1 */,
    REJECTED_NOT_AVAILABLE_IN_PLMN = 3 /* ::android::hardware::radio::V1_6::SliceStatus.ALLOWED implicitly + 1 */,
    REJECTED_NOT_AVAILABLE_IN_REG_AREA = 4 /* ::android::hardware::radio::V1_6::SliceStatus.REJECTED_NOT_AVAILABLE_IN_PLMN implicitly + 1 */,
    DEFAULT_CONFIGURED = 5 /* ::android::hardware::radio::V1_6::SliceStatus.REJECTED_NOT_AVAILABLE_IN_REG_AREA implicitly + 1 */,
};

/**
 * This struct represents a S-NSSAI as defined in 3GPP TS 24.501.
 */
struct SliceInfo final {
    /**
     * The type of service provided by the slice.
     *
     * see: 3GPP TS 24.501 Section 9.11.2.8.
     */
    ::android::hardware::radio::V1_6::SliceServiceType sst __attribute__ ((aligned(1)));
    /**
     * Slice differentiator is the identifier of a slice that has
     * SliceServiceType as SST. A value of -1 indicates that there is
     * no corresponding SliceInfo of the HPLMN.
     *
     * see: 3GPP TS 24.501 Section 9.11.2.8.
     */
    int32_t sliceDifferentiator __attribute__ ((aligned(4)));
    /**
     * This SST corresponds to a SliceInfo (S-NSSAI) of the HPLMN; the SST is
     * mapped to this value.
     *
     * see: 3GPP TS 24.501 Section 9.11.2.8.
     */
    ::android::hardware::radio::V1_6::SliceServiceType mappedHplmnSst __attribute__ ((aligned(1)));
    /**
     * Present only if both sliceDifferentiator and mappedHplmnSst are also
     * present. This SD corresponds to a SliceInfo (S-NSSAI) of the HPLMN;
     * sliceDifferentiator is mapped to this value. A value of -1 indicates that
     * there is no corresponding SliceInfo of the HPLMN.
     *
     * see: 3GPP TS 24.501 Section 9.11.2.8.
     */
    int32_t mappedHplmnSD __attribute__ ((aligned(4)));
    /**
     * Field to indicate the current status of the slice.
     */
    ::android::hardware::radio::V1_6::SliceStatus status __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::SliceInfo, sst) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SliceInfo, sliceDifferentiator) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SliceInfo, mappedHplmnSst) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SliceInfo, mappedHplmnSD) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SliceInfo, status) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::SliceInfo) == 20, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::SliceInfo) == 4, "wrong alignment");

/**
 * This safe_union represents an optional slice info
 */
struct OptionalSliceInfo final {
    enum class hidl_discriminator : uint8_t {
        noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
        value = 1,  // ::android::hardware::radio::V1_6::SliceInfo
    };

    OptionalSliceInfo();
    ~OptionalSliceInfo();
    OptionalSliceInfo(OptionalSliceInfo&&);
    OptionalSliceInfo(const OptionalSliceInfo&);
    OptionalSliceInfo& operator=(OptionalSliceInfo&&);
    OptionalSliceInfo& operator=(const OptionalSliceInfo&);

    void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
    void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
    ::android::hidl::safe_union::V1_0::Monostate& noinit();
    const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

    void value(const ::android::hardware::radio::V1_6::SliceInfo&);
    void value(::android::hardware::radio::V1_6::SliceInfo&&);
    ::android::hardware::radio::V1_6::SliceInfo& value();
    const ::android::hardware::radio::V1_6::SliceInfo& value() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::radio::V1_6::OptionalSliceInfo, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
        ::android::hardware::radio::V1_6::SliceInfo value __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::radio::V1_6::OptionalSliceInfo::hidl_union) == 20, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::OptionalSliceInfo::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::android::hardware::radio::V1_6::OptionalSliceInfo::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::OptionalSliceInfo::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::radio::V1_6::OptionalSliceInfo) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::OptionalSliceInfo) == 4, "wrong alignment");

/**
 * Overwritten from @1.5::SetupDataCallResult in order to change the suggestedRetryTime
 * to 64-bit value. In the future, this must be extended instead of overwritten.
 * Also added defaultQos, qosSessions, handoverFailureMode, pduSessionId, sliceInfo,
 * and traffic descriptors in this version.
 */
struct SetupDataCallResult final {
    /**
     * Data call fail cause. DataCallFailCause.NONE if no error.
     */
    ::android::hardware::radio::V1_6::DataCallFailCause cause __attribute__ ((aligned(4)));
    /**
     * If cause is not DataCallFailCause.NONE, this field indicates the network suggested data
     * retry back-off time in milliseconds. Negative value indicates network does not give any
     * suggestion. 0 indicates retry should be performed immediately. 0x7fffffffffffffff indicates
     * the device should not retry data setup anymore.
     *
     * During this time, no calls to IRadio@1.6::SetupDataCall for this APN will be made unless
     * IRadioIndication@1.6::unthrottleApn is sent with the same APN.
     */
    int64_t suggestedRetryTime __attribute__ ((aligned(8)));
    /**
     * Context ID, uniquely identifies this data connection.
     */
    int32_t cid __attribute__ ((aligned(4)));
    /**
     * Data connection active status.
     */
    ::android::hardware::radio::V1_4::DataConnActiveStatus active __attribute__ ((aligned(4)));
    /**
     * PDP protocol type. If cause is DataCallFailCause.ONLY_SINGLE_BEARER_ALLOWED, this is the
     * protocol type supported, such as "IP" or "IPV6".
     */
    ::android::hardware::radio::V1_4::PdpProtocolType type __attribute__ ((aligned(4)));
    /**
     * The network interface name.
     */
    ::android::hardware::hidl_string ifname __attribute__ ((aligned(8)));
    /**
     * List of link address.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_5::LinkAddress> addresses __attribute__ ((aligned(8)));
    /**
     * List of DNS server addresses, e.g., "192.0.1.3" or "192.0.1.11 2001:db8::1". Empty if no dns
     * server addresses returned.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> dnses __attribute__ ((aligned(8)));
    /**
     * List of default gateway addresses, e.g., "192.0.1.3" or "192.0.1.11 2001:db8::1".
     * When empty, the addresses represent point to point connections.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> gateways __attribute__ ((aligned(8)));
    /**
     * List of P-CSCF(Proxy Call State Control Function) addresses via PCO(Protocol Configuration
     * Option), e.g., "2001:db8::1 2001:db8::2 2001:db8::3". Empty if not IMS client.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> pcscf __attribute__ ((aligned(8)));
    /**
     * MTU received from network for IPv4.
     * Value <= 0 means network has either not sent a value or sent an invalid value.
     */
    int32_t mtuV4 __attribute__ ((aligned(4)));
    /**
     * MTU received from network for IPv6.
     * Value <= 0 means network has either not sent a value or sent an invalid value.
     */
    int32_t mtuV6 __attribute__ ((aligned(4)));
    /**
     * Default bearer QoS. Applicable to LTE and NR
     */
    ::android::hardware::radio::V1_6::Qos defaultQos __attribute__ ((aligned(4)));
    /**
     * Active QOS sessions of the dedicated bearers. Applicable to
     * PDNs that support dedicated bearers.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_6::QosSession> qosSessions __attribute__ ((aligned(8)));
    /**
     * Specifies the fallback mode on an IWLAN handover failure.
     */
    ::android::hardware::radio::V1_6::HandoverFailureMode handoverFailureMode __attribute__ ((aligned(1)));
    /**
     * The allocated pdu session id for this data call.
     * A value of 0 means no pdu session id was attached to this call.
     *
     * Reference: 3GPP TS 24.007 section 11.2.3.1b
     */
    int32_t pduSessionId __attribute__ ((aligned(4)));
    /**
     * Slice used for this data call. It is valid only when this data call is on
     * AccessNetwork:NGRAN.
     */
    ::android::hardware::radio::V1_6::OptionalSliceInfo sliceInfo __attribute__ ((aligned(4)));
    /**
     * TrafficDescriptors for which this data call must be used. It only includes
     * the TDs for which a data call has been requested so far; it is not an
     * exhaustive list.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_6::TrafficDescriptor> trafficDescriptors __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, cause) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, suggestedRetryTime) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, cid) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, active) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, type) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, ifname) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, addresses) == 48, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, dnses) == 64, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, gateways) == 80, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, pcscf) == 96, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, mtuV4) == 112, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, mtuV6) == 116, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, defaultQos) == 120, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, qosSessions) == 152, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, handoverFailureMode) == 168, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, pduSessionId) == 172, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, sliceInfo) == 176, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SetupDataCallResult, trafficDescriptors) == 200, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::SetupDataCallResult) == 216, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::SetupDataCallResult) == 8, "wrong alignment");

/**
 * NR Dual connectivity state
 */
enum class NrDualConnectivityState : int8_t {
    /**
     * Enable NR dual connectivity. Enabled state does not mean dual connectivity
     * is active. It means device is allowed to connect to both primary and secondary.
     */
    ENABLE = 1,
    /**
     * Disable NR dual connectivity. Disabled state does not mean secondary cell is released.
     * Modem will release it only if current bearer is released to avoid radio link failure.
     */
    DISABLE = 2,
    /**
     * Disable NR dual connectivity and force secondary cell to be released if dual connectivity
     * was active. This may result in radio link failure.
     */
    DISABLE_IMMEDIATE = 3,
};

/**
 * Overwritten from @1.2::LinkCapacityEstimate to update LinkCapacityEstimate to 1.6 version.
 */
struct LinkCapacityEstimate final {
    /**
     * Estimated downlink capacity in kbps. In case of a dual connected network,
     * this includes capacity of both primary and secondary. This bandwidth estimate shall be
     * the estimated maximum sustainable link bandwidth (as would be measured
     * at the Upper PDCP or SNDCP SAP). If the DL Aggregate Maximum Bit Rate is known,
     * this value shall not exceed the DL-AMBR for the Internet PDN connection.
     * This must be filled with 0 if network is not connected.
     */
    uint32_t downlinkCapacityKbps __attribute__ ((aligned(4)));
    /**
     * Estimated uplink capacity in kbps. In case of a dual connected network,
     * this includes capacity of both primary and secondary. This bandwidth estimate shall be the
     * estimated maximum sustainable link bandwidth (as would be measured at the
     * Upper PDCP or SNDCP SAP). If the UL Aggregate Maximum Bit Rate is known,
     * this value shall not exceed the UL-AMBR for the Internet PDN connection.
     * This must be filled with 0 if network is not connected.
     */
    uint32_t uplinkCapacityKbps __attribute__ ((aligned(4)));
    /**
     * Estimated downlink capacity of secondary carrier in a dual connected NR mode in kbps.
     * This bandwidth estimate shall be the estimated maximum sustainable link bandwidth
     * (as would be measured at the Upper PDCP or SNDCP SAP). This is valid only
     * in if device is connected to both primary and secodary in dual connected
     * mode. This must be filled with 0 if secondary is not connected or if
     * modem does not support this feature.
     */
    uint32_t secondaryDownlinkCapacityKbps __attribute__ ((aligned(4)));
    /**
     * Estimated uplink capacity secondary carrier in a dual connected NR mode in kbps.
     * This bandwidth estimate shall be the estimated
     * maximum sustainable link bandwidth (as would be measured at the Upper PDCP or SNDCP SAP).
     * This is valid only in if device is connected to both primary and secodary in dual connected
     * mode.This must be filled with 0 if secondary is not connected or if modem
     * does not support this feature.
     */
    uint32_t secondaryUplinkCapacityKbps __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::LinkCapacityEstimate, downlinkCapacityKbps) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::LinkCapacityEstimate, uplinkCapacityKbps) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::LinkCapacityEstimate, secondaryDownlinkCapacityKbps) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::LinkCapacityEstimate, secondaryUplinkCapacityKbps) == 12, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::LinkCapacityEstimate) == 16, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::LinkCapacityEstimate) == 4, "wrong alignment");

enum class DataThrottlingAction : int8_t {
    /*
     * Clear all existing data throttling.
     */
    NO_DATA_THROTTLING = 0,
    /**
     * Enact secondary carrier data throttling and remove any existing data
     * throttling on anchor carrier.
     */
    THROTTLE_SECONDARY_CARRIER = 1,
    /**
     * Enact anchor carrier data throttling and disable data on secondary
     * carrier if currently enabled.
     */
    THROTTLE_ANCHOR_CARRIER = 2,
    /**
     * Immediately hold on to current level of throttling.
     */
    HOLD = 3,
};

/**
 * Defines the values for VoPS indicator of NR as per 3gpp spec 24.501 sec 9.10.3.5
 */
enum class VopsIndicator : uint8_t {
    /**
     * IMS voice over PS session not supported
     */
    VOPS_NOT_SUPPORTED = 0,
    /**
     * IMS voice over PS session supported over 3GPP access
     */
    VOPS_OVER_3GPP = 1,
    /**
     * IMS voice over PS session supported over non-3GPP access
     */
    VOPS_OVER_NON_3GPP = 2,
};

/**
 * Defines the values for emergency service indicator of NR
 * as per 3gpp spec 24.501 sec 9.10.3.5
 */
enum class EmcIndicator : uint8_t {
    /**
     * Emergency services not supported
     */
    EMC_NOT_SUPPORTED = 0,
    /**
     * Emergency services supported in NR connected to 5GCN only
     */
    EMC_NR_CONNECTED_TO_5GCN = 1,
    /**
     * Emergency services supported in E-UTRA connected to 5GCN only
     */
    EMC_EUTRA_CONNECTED_TO_5GCN = 2,
    /**
     * Emergency services supported in NR connected to 5GCN and E-UTRA connected to 5GCN
     */
    EMC_BOTH_NR_EUTRA_CONNECTED_TO_5GCN = 3,
};

/**
 * Defines the values for emergency service fallback indicator of NR
 * as per 3gpp spec 24.501 sec 9.10.3.5
 */
enum class EmfIndicator : uint8_t {
    /**
     * Emergency services fallback not supported
     */
    EMF_NOT_SUPPORTED = 0,
    /**
     * Emergency services fallback supported in NR connected to 5GCN only
     */
    EMF_NR_CONNECTED_TO_5GCN = 1,
    /**
     * Emergency services fallback supported in E-UTRA connected to 5GCN only
     */
    EMF_EUTRA_CONNECTED_TO_5GCN = 2,
    /**
     * Emergency services fallback supported in NR connected to 5GCN and E-UTRA
     * connected to 5GCN.
     */
    EMF_BOTH_NR_EUTRA_CONNECTED_TO_5GCN = 3,
};

/**
 * Type to define the NR specific network capabilities for voice over PS including
 * emergency and normal voice calls.
 */
struct NrVopsInfo final {
    /**
     * This indicates if the camped network supports VoNR services, and what kind of services
     * it supports. This information is received from NR network during NR NAS registration
     * procedure through NR REGISTRATION ACCEPT.
     * Refer 3GPP 24.501 EPS 5GS network feature support -> IMS VoPS
     */
    ::android::hardware::radio::V1_6::VopsIndicator vopsSupported __attribute__ ((aligned(1)));
    /**
     * This indicates if the camped network supports VoNR emergency service. This information
     * is received from NR network through two sources:
     * a. During NR NAS registration procedure through NR REGISTRATION ACCEPT.
     *    Refer 3GPP 24.501 EPS 5GS network feature support -> EMC
     * b. In case the device is not registered on the network.
     *    Refer 3GPP 38.331 SIB1 : ims-EmergencySupport
     *    If device is registered on NR, then this field indicates whether the cell
     *    supports IMS emergency bearer services for UEs in limited service mode.
     */
    ::android::hardware::radio::V1_6::EmcIndicator emcSupported __attribute__ ((aligned(1)));
    /**
     * This indicates if the camped network supports VoNR emergency service fallback. This
     * information is received from NR network during NR NAS registration procedure through
     * NR REGISTRATION ACCEPT.
     * Refer 3GPP 24.501 EPS 5GS network feature support -> EMF
     */
    ::android::hardware::radio::V1_6::EmfIndicator emfSupported __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::NrVopsInfo, vopsSupported) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::NrVopsInfo, emcSupported) == 1, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::NrVopsInfo, emfSupported) == 2, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::NrVopsInfo) == 3, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::NrVopsInfo) == 1, "wrong alignment");

struct LteSignalStrength final {
    ::android::hardware::radio::V1_0::LteSignalStrength base __attribute__ ((aligned(4)));
    /**
     * CSI channel quality indicator (CQI) table index. There are multiple CQI tables.
     * The definition of CQI in each table is different.
     *
     * Reference: 3GPP TS 136.213 section 7.2.3.
     *
     * Range [1, 6], INT_MAX means invalid/unreported.
     */
    uint32_t cqiTableIndex __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::LteSignalStrength, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::LteSignalStrength, cqiTableIndex) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::LteSignalStrength) == 28, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::LteSignalStrength) == 4, "wrong alignment");

struct NrSignalStrength final {
    ::android::hardware::radio::V1_4::NrSignalStrength base __attribute__ ((aligned(4)));
    /**
     * CSI channel quality indicator (CQI) table index. There are multiple CQI tables.
     * The definition of CQI in each table is different.
     *
     * Reference: 3GPP TS 138.214 section 5.2.2.1.
     *
     * Range [1, 3], INT_MAX means invalid/unreported.
     */
    uint32_t csiCqiTableIndex __attribute__ ((aligned(4)));
    /**
     * CSI channel quality indicator (CQI) for all subbands.
     *
     * If the CQI report is for the entire wideband, a single CQI index is provided.
     * If the CQI report is for all subbands, one CQI index is provided for each subband,
     * in ascending order of subband index.
     * If CQI is not available, the CQI report is empty.
     *
     * Reference: 3GPP TS 138.214 section 5.2.2.1.
     *
     * Range [0, 15], 0xFF means invalid/unreported.
     */
    ::android::hardware::hidl_vec<uint8_t> csiCqiReport __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::NrSignalStrength, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::NrSignalStrength, csiCqiTableIndex) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::NrSignalStrength, csiCqiReport) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::NrSignalStrength) == 48, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::NrSignalStrength) == 8, "wrong alignment");

/**
 * Overwritten from @1.4::SignalStrength in order to update LteSignalStrength and NrSignalStrength.
 */
struct SignalStrength final {
    /**
     * If GSM measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::GsmSignalStrength gsm __attribute__ ((aligned(4)));
    /**
     * If CDMA measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::CdmaSignalStrength cdma __attribute__ ((aligned(4)));
    /**
     * If EvDO measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_0::EvdoSignalStrength evdo __attribute__ ((aligned(4)));
    /**
     * If LTE measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_6::LteSignalStrength lte __attribute__ ((aligned(4)));
    /**
     * If TD-SCDMA measurements are provided, this structure must contain valid measurements;
     * otherwise all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_2::TdscdmaSignalStrength tdscdma __attribute__ ((aligned(4)));
    /**
     * If WCDMA measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_2::WcdmaSignalStrength wcdma __attribute__ ((aligned(4)));
    /**
     * If NR 5G measurements are provided, this structure must contain valid measurements; otherwise
     * all fields should be set to INT_MAX to mark them as invalid.
     */
    ::android::hardware::radio::V1_6::NrSignalStrength nr __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::SignalStrength, gsm) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SignalStrength, cdma) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SignalStrength, evdo) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SignalStrength, lte) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SignalStrength, tdscdma) == 60, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SignalStrength, wcdma) == 72, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SignalStrength, nr) == 88, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::SignalStrength) == 136, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::SignalStrength) == 8, "wrong alignment");

/**
 * Overwritten from @1.5::CellInfoLte in order to update LteSignalStrength.
 */
struct CellInfoLte final {
    ::android::hardware::radio::V1_5::CellIdentityLte cellIdentityLte __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_6::LteSignalStrength signalStrengthLte __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::CellInfoLte, cellIdentityLte) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::CellInfoLte, signalStrengthLte) == 160, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::CellInfoLte) == 192, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::CellInfoLte) == 8, "wrong alignment");

/**
 * Overwritten from @1.5::CellInfoNr in order to update NrSignalStrength.
 */
struct CellInfoNr final {
    ::android::hardware::radio::V1_5::CellIdentityNr cellIdentityNr __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_6::NrSignalStrength signalStrengthNr __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::CellInfoNr, cellIdentityNr) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::CellInfoNr, signalStrengthNr) == 120, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::CellInfoNr) == 168, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::CellInfoNr) == 8, "wrong alignment");

/**
 * Overwritten from @1.5::CellInfo in order to update LteSignalStrength and NrSignalStrength.
 */
struct CellInfo final {
    // Forward declaration for forward reference support:
    struct CellInfoRatSpecificInfo;

    struct CellInfoRatSpecificInfo final {
        enum class hidl_discriminator : uint8_t {
            /**
             * 3gpp CellInfo types.
             */
            gsm = 0,  // ::android::hardware::radio::V1_5::CellInfoGsm
            wcdma = 1,  // ::android::hardware::radio::V1_5::CellInfoWcdma
            tdscdma = 2,  // ::android::hardware::radio::V1_5::CellInfoTdscdma
            lte = 3,  // ::android::hardware::radio::V1_6::CellInfoLte
            nr = 4,  // ::android::hardware::radio::V1_6::CellInfoNr
            /**
             * 3gpp2 CellInfo types;
             */
            cdma = 5,  // ::android::hardware::radio::V1_2::CellInfoCdma
        };

        CellInfoRatSpecificInfo();
        ~CellInfoRatSpecificInfo();
        CellInfoRatSpecificInfo(CellInfoRatSpecificInfo&&);
        CellInfoRatSpecificInfo(const CellInfoRatSpecificInfo&);
        CellInfoRatSpecificInfo& operator=(CellInfoRatSpecificInfo&&);
        CellInfoRatSpecificInfo& operator=(const CellInfoRatSpecificInfo&);

        void gsm(const ::android::hardware::radio::V1_5::CellInfoGsm&);
        void gsm(::android::hardware::radio::V1_5::CellInfoGsm&&);
        ::android::hardware::radio::V1_5::CellInfoGsm& gsm();
        const ::android::hardware::radio::V1_5::CellInfoGsm& gsm() const;

        void wcdma(const ::android::hardware::radio::V1_5::CellInfoWcdma&);
        void wcdma(::android::hardware::radio::V1_5::CellInfoWcdma&&);
        ::android::hardware::radio::V1_5::CellInfoWcdma& wcdma();
        const ::android::hardware::radio::V1_5::CellInfoWcdma& wcdma() const;

        void tdscdma(const ::android::hardware::radio::V1_5::CellInfoTdscdma&);
        void tdscdma(::android::hardware::radio::V1_5::CellInfoTdscdma&&);
        ::android::hardware::radio::V1_5::CellInfoTdscdma& tdscdma();
        const ::android::hardware::radio::V1_5::CellInfoTdscdma& tdscdma() const;

        void lte(const ::android::hardware::radio::V1_6::CellInfoLte&);
        void lte(::android::hardware::radio::V1_6::CellInfoLte&&);
        ::android::hardware::radio::V1_6::CellInfoLte& lte();
        const ::android::hardware::radio::V1_6::CellInfoLte& lte() const;

        void nr(const ::android::hardware::radio::V1_6::CellInfoNr&);
        void nr(::android::hardware::radio::V1_6::CellInfoNr&&);
        ::android::hardware::radio::V1_6::CellInfoNr& nr();
        const ::android::hardware::radio::V1_6::CellInfoNr& nr() const;

        void cdma(const ::android::hardware::radio::V1_2::CellInfoCdma&);
        void cdma(::android::hardware::radio::V1_2::CellInfoCdma&&);
        ::android::hardware::radio::V1_2::CellInfoCdma& cdma();
        const ::android::hardware::radio::V1_2::CellInfoCdma& cdma() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::radio::V1_6::CellInfo::CellInfoRatSpecificInfo, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::radio::V1_5::CellInfoGsm gsm __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_5::CellInfoWcdma wcdma __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_5::CellInfoTdscdma tdscdma __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_6::CellInfoLte lte __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_6::CellInfoNr nr __attribute__ ((aligned(8)));
            ::android::hardware::radio::V1_2::CellInfoCdma cdma __attribute__ ((aligned(8)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::radio::V1_6::CellInfo::CellInfoRatSpecificInfo::hidl_union) == 192, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_6::CellInfo::CellInfoRatSpecificInfo::hidl_union) == 8, "wrong alignment");
        static_assert(sizeof(::android::hardware::radio::V1_6::CellInfo::CellInfoRatSpecificInfo::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_6::CellInfo::CellInfoRatSpecificInfo::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::radio::V1_6::CellInfo::CellInfoRatSpecificInfo) == 200, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::CellInfo::CellInfoRatSpecificInfo) == 8, "wrong alignment");

    /**
     * True if this cell is registered false if not registered.
     */
    bool registered __attribute__ ((aligned(1)));
    /**
     * Connection status for the cell.
     */
    ::android::hardware::radio::V1_2::CellConnectionStatus connectionStatus __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_6::CellInfo::CellInfoRatSpecificInfo ratSpecificInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::CellInfo, registered) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::CellInfo, connectionStatus) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::CellInfo, ratSpecificInfo) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::CellInfo) == 208, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::CellInfo) == 8, "wrong alignment");

/**
 * Overwritten from @1.5::NetworkScanResult in order to update the CellInfo to 1.6 version.
 */
struct NetworkScanResult final {
    /**
     * The status of the scan.
     */
    ::android::hardware::radio::V1_1::ScanStatus status __attribute__ ((aligned(4)));
    /**
     * The error code of the incremental result.
     */
    ::android::hardware::radio::V1_6::RadioError error __attribute__ ((aligned(4)));
    /**
     * List of network information as CellInfo.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_6::CellInfo> networkInfos __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::NetworkScanResult, status) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::NetworkScanResult, error) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::NetworkScanResult, networkInfos) == 8, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::NetworkScanResult) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::NetworkScanResult) == 8, "wrong alignment");

/**
 * Overwritten from @1.5::RegStateResult to 1.6 to support NrRegistrationInfo
 * version.
 */
struct RegStateResult final {
    // Forward declaration for forward reference support:
    struct AccessTechnologySpecificInfo;

    struct AccessTechnologySpecificInfo final {
        enum class hidl_discriminator : uint8_t {
            noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
            cdmaInfo = 1,  // ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo
            eutranInfo = 2,  // ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo
            /**
             * Network capabilities for voice over PS services. This info is valid only on NR
             * network and must be present when the device is camped on NR. VopsInfo must be
             * empty when the device is not camped on NR.
             */
            ngranNrVopsInfo = 3,  // ::android::hardware::radio::V1_6::NrVopsInfo
            /**
             * True if the dual transfer mode is supported.
             * Refer to 3GPP TS 44.108 section 3.4.25.3
             */
            geranDtmSupported = 4,  // bool
        };

        AccessTechnologySpecificInfo();
        ~AccessTechnologySpecificInfo();
        AccessTechnologySpecificInfo(AccessTechnologySpecificInfo&&);
        AccessTechnologySpecificInfo(const AccessTechnologySpecificInfo&);
        AccessTechnologySpecificInfo& operator=(AccessTechnologySpecificInfo&&);
        AccessTechnologySpecificInfo& operator=(const AccessTechnologySpecificInfo&);

        void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
        void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
        ::android::hidl::safe_union::V1_0::Monostate& noinit();
        const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

        void cdmaInfo(const ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo&);
        void cdmaInfo(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo&&);
        ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo& cdmaInfo();
        const ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo& cdmaInfo() const;

        void eutranInfo(const ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo&);
        void eutranInfo(::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo&&);
        ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo& eutranInfo();
        const ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo& eutranInfo() const;

        void ngranNrVopsInfo(const ::android::hardware::radio::V1_6::NrVopsInfo&);
        void ngranNrVopsInfo(::android::hardware::radio::V1_6::NrVopsInfo&&);
        ::android::hardware::radio::V1_6::NrVopsInfo& ngranNrVopsInfo();
        const ::android::hardware::radio::V1_6::NrVopsInfo& ngranNrVopsInfo() const;

        void geranDtmSupported(bool);
        bool& geranDtmSupported();
        bool geranDtmSupported() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::radio::V1_6::RegStateResult::AccessTechnologySpecificInfo, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
            ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::Cdma2000RegistrationInfo cdmaInfo __attribute__ ((aligned(4)));
            ::android::hardware::radio::V1_5::RegStateResult::AccessTechnologySpecificInfo::EutranRegistrationInfo eutranInfo __attribute__ ((aligned(1)));
            ::android::hardware::radio::V1_6::NrVopsInfo ngranNrVopsInfo __attribute__ ((aligned(1)));
            bool geranDtmSupported __attribute__ ((aligned(1)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::radio::V1_6::RegStateResult::AccessTechnologySpecificInfo::hidl_union) == 16, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_6::RegStateResult::AccessTechnologySpecificInfo::hidl_union) == 4, "wrong alignment");
        static_assert(sizeof(::android::hardware::radio::V1_6::RegStateResult::AccessTechnologySpecificInfo::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_6::RegStateResult::AccessTechnologySpecificInfo::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::radio::V1_6::RegStateResult::AccessTechnologySpecificInfo) == 20, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::RegStateResult::AccessTechnologySpecificInfo) == 4, "wrong alignment");

    /**
     * Registration state
     *
     * If the RAT is indicated as a GERAN, UTRAN, or CDMA2000 technology, this value reports
     * registration in the Circuit-switched domain.
     * If the RAT is indicated as an EUTRAN, NGRAN, or another technology that does not support
     * circuit-switched services, this value reports registration in the Packet-switched domain.
     */
    ::android::hardware::radio::V1_0::RegState regState __attribute__ ((aligned(4)));
    /**
     * Indicates the available voice radio technology, valid values as defined by RadioTechnology,
     * except LTE_CA, which is no longer a valid value on 1.5 or above. When the device is on
     * carrier aggregation, vendor RIL service should properly report multiple PhysicalChannelConfig
     * elements through IRadio::currentPhysicalChannelConfigs_1_6.
     */
    ::android::hardware::radio::V1_4::RadioTechnology rat __attribute__ ((aligned(4)));
    /**
     * Cause code reported by the network in case registration fails. This will be a mobility
     * management cause code defined for MM, GMM, MME or equivalent as appropriate for the RAT.
     */
    ::android::hardware::radio::V1_5::RegistrationFailCause reasonForDenial __attribute__ ((aligned(4)));
    /**
     * CellIdentity
     */
    ::android::hardware::radio::V1_5::CellIdentity cellIdentity __attribute__ ((aligned(8)));
    /**
     * The most-recent PLMN-ID upon which the UE registered (or attempted to register if a failure
     * is reported in the reasonForDenial field). This PLMN shall be in standard format consisting
     * of a 3 digit MCC concatenated with a 2 or 3 digit MNC.
     */
    ::android::hardware::hidl_string registeredPlmn __attribute__ ((aligned(8)));
    /**
     * Access-technology-specific registration information, such as for CDMA2000.
     */
    ::android::hardware::radio::V1_6::RegStateResult::AccessTechnologySpecificInfo accessTechnologySpecificInfo __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::RegStateResult, regState) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::RegStateResult, rat) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::RegStateResult, reasonForDenial) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::RegStateResult, cellIdentity) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::RegStateResult, registeredPlmn) == 184, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::RegStateResult, accessTechnologySpecificInfo) == 200, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::RegStateResult) == 224, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::RegStateResult) == 8, "wrong alignment");

struct Call final {
    ::android::hardware::radio::V1_2::Call base __attribute__ ((aligned(8)));
    /**
     * Forwarded number. It can set only one forwarded number based on 3GPP rule of the CS.
     * Reference: 3GPP TS 24.008 section 10.5.4.21b
     */
    ::android::hardware::hidl_string forwardedNumber __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::Call, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::Call, forwardedNumber) == 96, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::Call) == 112, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::Call) == 8, "wrong alignment");

/**
 * Extended from @1.5 NgranBands
 * IRadio 1.6 supports NGRAN bands up to V16.5.0
 */
enum class NgranBands : int32_t {
    /**
     * 3GPP TS 38.101-1, Table 5.2-1: FR1 bands
     */
    BAND_1 = 1,
    BAND_2 = 2,
    BAND_3 = 3,
    BAND_5 = 5,
    BAND_7 = 7,
    BAND_8 = 8,
    BAND_12 = 12,
    BAND_14 = 14,
    BAND_18 = 18,
    BAND_20 = 20,
    BAND_25 = 25,
    BAND_28 = 28,
    BAND_29 = 29,
    BAND_30 = 30,
    BAND_34 = 34,
    BAND_38 = 38,
    BAND_39 = 39,
    BAND_40 = 40,
    BAND_41 = 41,
    BAND_48 = 48,
    BAND_50 = 50,
    BAND_51 = 51,
    BAND_65 = 65,
    BAND_66 = 66,
    BAND_70 = 70,
    BAND_71 = 71,
    BAND_74 = 74,
    BAND_75 = 75,
    BAND_76 = 76,
    BAND_77 = 77,
    BAND_78 = 78,
    BAND_79 = 79,
    BAND_80 = 80,
    BAND_81 = 81,
    BAND_82 = 82,
    BAND_83 = 83,
    BAND_84 = 84,
    BAND_86 = 86,
    BAND_89 = 89,
    BAND_90 = 90,
    BAND_91 = 91,
    BAND_92 = 92,
    BAND_93 = 93,
    BAND_94 = 94,
    BAND_95 = 95,
    /**
     * 3GPP TS 38.101-2, Table 5.2-1: FR2 bands
     */
    BAND_257 = 257,
    BAND_258 = 258,
    BAND_260 = 260,
    BAND_261 = 261,
    /**
     * 3GPP TS 38.101-1, Table 5.2-1: FR1 bands
     */
    BAND_26 = 26,
    BAND_46 = 46,
    BAND_53 = 53,
    BAND_96 = 96,
};

struct PhysicalChannelConfig final {
    // Forward declaration for forward reference support:
    struct Band;

    struct Band final {
        enum class hidl_discriminator : uint8_t {
            /**
             * Valid only if radioAccessNetwork = GERAN.
             */
            geranBand = 0,  // ::android::hardware::radio::V1_1::GeranBands
            /**
             * Valid only if radioAccessNetwork = UTRAN.
             */
            utranBand = 1,  // ::android::hardware::radio::V1_1::UtranBands
            /**
             * Valid only if radioAccessNetwork = EUTRAN.
             */
            eutranBand = 2,  // ::android::hardware::radio::V1_1::EutranBands
            /**
             * Valid only if radioAccessNetwork = NGRAN.
             */
            ngranBand = 3,  // ::android::hardware::radio::V1_6::NgranBands
        };

        Band();
        ~Band();
        Band(Band&&);
        Band(const Band&);
        Band& operator=(Band&&);
        Band& operator=(const Band&);

        void geranBand(::android::hardware::radio::V1_1::GeranBands);
        ::android::hardware::radio::V1_1::GeranBands& geranBand();
        ::android::hardware::radio::V1_1::GeranBands geranBand() const;

        void utranBand(::android::hardware::radio::V1_1::UtranBands);
        ::android::hardware::radio::V1_1::UtranBands& utranBand();
        ::android::hardware::radio::V1_1::UtranBands utranBand() const;

        void eutranBand(::android::hardware::radio::V1_1::EutranBands);
        ::android::hardware::radio::V1_1::EutranBands& eutranBand();
        ::android::hardware::radio::V1_1::EutranBands eutranBand() const;

        void ngranBand(::android::hardware::radio::V1_6::NgranBands);
        ::android::hardware::radio::V1_6::NgranBands& ngranBand();
        ::android::hardware::radio::V1_6::NgranBands ngranBand() const;

        // Utility methods
        hidl_discriminator getDiscriminator() const;

        constexpr size_t hidl_getUnionOffset() const {
            return offsetof(::android::hardware::radio::V1_6::PhysicalChannelConfig::Band, hidl_u);
        }

    private:
        void hidl_destructUnion();

        hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
        union hidl_union final {
            ::android::hardware::radio::V1_1::GeranBands geranBand __attribute__ ((aligned(4)));
            ::android::hardware::radio::V1_1::UtranBands utranBand __attribute__ ((aligned(4)));
            ::android::hardware::radio::V1_1::EutranBands eutranBand __attribute__ ((aligned(4)));
            ::android::hardware::radio::V1_6::NgranBands ngranBand __attribute__ ((aligned(4)));

            hidl_union();
            ~hidl_union();
        } hidl_u;

        static_assert(sizeof(::android::hardware::radio::V1_6::PhysicalChannelConfig::Band::hidl_union) == 4, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_6::PhysicalChannelConfig::Band::hidl_union) == 4, "wrong alignment");
        static_assert(sizeof(::android::hardware::radio::V1_6::PhysicalChannelConfig::Band::hidl_discriminator) == 1, "wrong size");
        static_assert(__alignof(::android::hardware::radio::V1_6::PhysicalChannelConfig::Band::hidl_discriminator) == 1, "wrong alignment");
    };

    static_assert(sizeof(::android::hardware::radio::V1_6::PhysicalChannelConfig::Band) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::PhysicalChannelConfig::Band) == 4, "wrong alignment");

    /**
     * Connection status for cell. Valid values are PRIMARY_SERVING and SECONDARY_SERVING
     */
    ::android::hardware::radio::V1_2::CellConnectionStatus status __attribute__ ((aligned(4)));
    /**
     * The radio technology for this physical channel
     */
    ::android::hardware::radio::V1_4::RadioTechnology rat __attribute__ ((aligned(4)));
    /**
     * Downlink Absolute Radio Frequency Channel Number
     */
    int32_t downlinkChannelNumber __attribute__ ((aligned(4)));
    /**
     * Uplink Absolute Radio Frequency Channel Number
     */
    int32_t uplinkChannelNumber __attribute__ ((aligned(4)));
    /**
     * Downlink cell bandwidth, in kHz
     */
    int32_t cellBandwidthDownlinkKhz __attribute__ ((aligned(4)));
    /**
     * Uplink cell bandwidth, in kHz
     */
    int32_t cellBandwidthUplinkKhz __attribute__ ((aligned(4)));
    /**
     * A list of data calls mapped to this physical channel. The context id must match the cid of
     * @1.5::SetupDataCallResult. An empty list means the physical channel has no data call mapped
     * to it.
     */
    ::android::hardware::hidl_vec<int32_t> contextIds __attribute__ ((aligned(8)));
    /**
     * The physical cell identifier for this cell.
     *
     * In UTRAN, this value is primary scrambling code. The range is [0, 511].
     * Reference: 3GPP TS 25.213 section 5.2.2.
     *
     * In EUTRAN, this value is physical layer cell identity. The range is [0, 503].
     * Reference: 3GPP TS 36.211 section 6.11.
     *
     * In 5G RAN, this value is physical layer cell identity. The range is [0, 1007].
     * Reference: 3GPP TS 38.211 section 7.4.2.1.
     */
    uint32_t physicalCellId __attribute__ ((aligned(4)));
    /**
     * The frequency band to scan.
     */
    ::android::hardware::radio::V1_6::PhysicalChannelConfig::Band band __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::PhysicalChannelConfig, status) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhysicalChannelConfig, rat) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhysicalChannelConfig, downlinkChannelNumber) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhysicalChannelConfig, uplinkChannelNumber) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhysicalChannelConfig, cellBandwidthDownlinkKhz) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhysicalChannelConfig, cellBandwidthUplinkKhz) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhysicalChannelConfig, contextIds) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhysicalChannelConfig, physicalCellId) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhysicalChannelConfig, band) == 44, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::PhysicalChannelConfig) == 56, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::PhysicalChannelConfig) == 8, "wrong alignment");

/**
 * This safe_union represents an optional DNN. DNN stands for Data Network Name
 * and represents an APN as defined in 3GPP TS 23.003.
 */
struct OptionalDnn final {
    enum class hidl_discriminator : uint8_t {
        noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
        value = 1,  // ::android::hardware::hidl_string
    };

    OptionalDnn();
    ~OptionalDnn();
    OptionalDnn(OptionalDnn&&);
    OptionalDnn(const OptionalDnn&);
    OptionalDnn& operator=(OptionalDnn&&);
    OptionalDnn& operator=(const OptionalDnn&);

    void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
    void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
    ::android::hidl::safe_union::V1_0::Monostate& noinit();
    const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

    void value(const ::android::hardware::hidl_string&);
    void value(::android::hardware::hidl_string&&);
    ::android::hardware::hidl_string& value();
    const ::android::hardware::hidl_string& value() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::radio::V1_6::OptionalDnn, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
        ::android::hardware::hidl_string value __attribute__ ((aligned(8)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::radio::V1_6::OptionalDnn::hidl_union) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::OptionalDnn::hidl_union) == 8, "wrong alignment");
    static_assert(sizeof(::android::hardware::radio::V1_6::OptionalDnn::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::OptionalDnn::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::radio::V1_6::OptionalDnn) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::OptionalDnn) == 8, "wrong alignment");

/**
 * This struct represents the OsId + OsAppId as defined in TS 24.526 Section 5.2
 */
struct OsAppId final {
    /**
     * Byte array representing OsId + OsAppId. The minimum length of the array is
     * 18 and maximum length is 272 (16 bytes for OsId + 1 byte for OsAppId length
     * + up to 255 bytes for OsAppId).
     */
    ::android::hardware::hidl_vec<uint8_t> osAppId __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::OsAppId, osAppId) == 0, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::OsAppId) == 16, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::OsAppId) == 8, "wrong alignment");

/**
 * This safe_union represents an optional OsAppId.
 */
struct OptionalOsAppId final {
    enum class hidl_discriminator : uint8_t {
        noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
        value = 1,  // ::android::hardware::radio::V1_6::OsAppId
    };

    OptionalOsAppId();
    ~OptionalOsAppId();
    OptionalOsAppId(OptionalOsAppId&&);
    OptionalOsAppId(const OptionalOsAppId&);
    OptionalOsAppId& operator=(OptionalOsAppId&&);
    OptionalOsAppId& operator=(const OptionalOsAppId&);

    void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
    void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
    ::android::hidl::safe_union::V1_0::Monostate& noinit();
    const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

    void value(const ::android::hardware::radio::V1_6::OsAppId&);
    void value(::android::hardware::radio::V1_6::OsAppId&&);
    ::android::hardware::radio::V1_6::OsAppId& value();
    const ::android::hardware::radio::V1_6::OsAppId& value() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::radio::V1_6::OptionalOsAppId, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
        ::android::hardware::radio::V1_6::OsAppId value __attribute__ ((aligned(8)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::radio::V1_6::OptionalOsAppId::hidl_union) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::OptionalOsAppId::hidl_union) == 8, "wrong alignment");
    static_assert(sizeof(::android::hardware::radio::V1_6::OptionalOsAppId::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::OptionalOsAppId::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::radio::V1_6::OptionalOsAppId) == 24, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::OptionalOsAppId) == 8, "wrong alignment");

/**
 * This struct represents a traffic descriptor. A valid struct must have at least
 * one of the optional values present. This is based on the definition of traffic
 * descriptor in TS 24.526 Section 5.2.
 */
struct TrafficDescriptor final {
    /**
     * DNN stands for Data Network Name and represents an APN as defined in
     * 3GPP TS 23.003.
     */
    ::android::hardware::radio::V1_6::OptionalDnn dnn __attribute__ ((aligned(8)));
    /**
     * Indicates the OsId + OsAppId (used as category in Android).
     */
    ::android::hardware::radio::V1_6::OptionalOsAppId osAppId __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::TrafficDescriptor, dnn) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::TrafficDescriptor, osAppId) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::TrafficDescriptor) == 48, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::TrafficDescriptor) == 8, "wrong alignment");

/**
 * This safe_union represents an optional TrafficDescriptor.
 */
struct OptionalTrafficDescriptor final {
    enum class hidl_discriminator : uint8_t {
        noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
        value = 1,  // ::android::hardware::radio::V1_6::TrafficDescriptor
    };

    OptionalTrafficDescriptor();
    ~OptionalTrafficDescriptor();
    OptionalTrafficDescriptor(OptionalTrafficDescriptor&&);
    OptionalTrafficDescriptor(const OptionalTrafficDescriptor&);
    OptionalTrafficDescriptor& operator=(OptionalTrafficDescriptor&&);
    OptionalTrafficDescriptor& operator=(const OptionalTrafficDescriptor&);

    void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
    void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
    ::android::hidl::safe_union::V1_0::Monostate& noinit();
    const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

    void value(const ::android::hardware::radio::V1_6::TrafficDescriptor&);
    void value(::android::hardware::radio::V1_6::TrafficDescriptor&&);
    ::android::hardware::radio::V1_6::TrafficDescriptor& value();
    const ::android::hardware::radio::V1_6::TrafficDescriptor& value() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::radio::V1_6::OptionalTrafficDescriptor, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
        ::android::hardware::radio::V1_6::TrafficDescriptor value __attribute__ ((aligned(8)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::radio::V1_6::OptionalTrafficDescriptor::hidl_union) == 48, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::OptionalTrafficDescriptor::hidl_union) == 8, "wrong alignment");
    static_assert(sizeof(::android::hardware::radio::V1_6::OptionalTrafficDescriptor::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::OptionalTrafficDescriptor::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::radio::V1_6::OptionalTrafficDescriptor) == 56, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::OptionalTrafficDescriptor) == 8, "wrong alignment");

/**
 * This struct represents the current slicing configuration.
 */
struct SlicingConfig final {
    /**
     * This vector contains the current URSP rules. Empty vector represents that no
     * rules are configured.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_6::UrspRule> urspRules __attribute__ ((aligned(8)));
    /**
     * List of all slices.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_6::SliceInfo> sliceInfo __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::SlicingConfig, urspRules) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::SlicingConfig, sliceInfo) == 16, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::SlicingConfig) == 32, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::SlicingConfig) == 8, "wrong alignment");

/**
 * This struct represents a single URSP rule as defined in 3GPP TS 24.526.
 */
struct UrspRule final {
    /**
     * Precedence value in the range of 0 to 255. Higher value has lower
     * precedence.
     */
    uint8_t precedence __attribute__ ((aligned(1)));
    /**
     * Used as a matcher for network requests.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_6::TrafficDescriptor> trafficDescriptors __attribute__ ((aligned(8)));
    /**
     * List of routes (connection parameters) that must be used for requests
     * matching a trafficDescriptor.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_6::RouteSelectionDescriptor> routeSelectionDescriptor __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::UrspRule, precedence) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::UrspRule, trafficDescriptors) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::UrspRule, routeSelectionDescriptor) == 24, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::UrspRule) == 40, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::UrspRule) == 8, "wrong alignment");

/**
 * This safe_union represents an optional PdpProtocolType.
 */
struct OptionalPdpProtocolType final {
    enum class hidl_discriminator : uint8_t {
        noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
        value = 1,  // ::android::hardware::radio::V1_4::PdpProtocolType
    };

    OptionalPdpProtocolType();
    ~OptionalPdpProtocolType();
    OptionalPdpProtocolType(OptionalPdpProtocolType&&);
    OptionalPdpProtocolType(const OptionalPdpProtocolType&);
    OptionalPdpProtocolType& operator=(OptionalPdpProtocolType&&);
    OptionalPdpProtocolType& operator=(const OptionalPdpProtocolType&);

    void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
    void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
    ::android::hidl::safe_union::V1_0::Monostate& noinit();
    const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

    void value(::android::hardware::radio::V1_4::PdpProtocolType);
    ::android::hardware::radio::V1_4::PdpProtocolType& value();
    ::android::hardware::radio::V1_4::PdpProtocolType value() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::radio::V1_6::OptionalPdpProtocolType, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
        ::android::hardware::radio::V1_4::PdpProtocolType value __attribute__ ((aligned(4)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::radio::V1_6::OptionalPdpProtocolType::hidl_union) == 4, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::OptionalPdpProtocolType::hidl_union) == 4, "wrong alignment");
    static_assert(sizeof(::android::hardware::radio::V1_6::OptionalPdpProtocolType::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::OptionalPdpProtocolType::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::radio::V1_6::OptionalPdpProtocolType) == 8, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::OptionalPdpProtocolType) == 4, "wrong alignment");

/**
 * Enum representing session and service continuity mode as defined in
 * 3GPP TS 23.501.
 */
enum class SscMode : int8_t {
    MODE_1 = 1,
    MODE_2 = 2,
    MODE_3 = 3,
};

/**
 * This safe_union represents an optional SscMode.
 */
struct OptionalSscMode final {
    enum class hidl_discriminator : uint8_t {
        noinit = 0,  // ::android::hidl::safe_union::V1_0::Monostate
        value = 1,  // ::android::hardware::radio::V1_6::SscMode
    };

    OptionalSscMode();
    ~OptionalSscMode();
    OptionalSscMode(OptionalSscMode&&);
    OptionalSscMode(const OptionalSscMode&);
    OptionalSscMode& operator=(OptionalSscMode&&);
    OptionalSscMode& operator=(const OptionalSscMode&);

    void noinit(const ::android::hidl::safe_union::V1_0::Monostate&);
    void noinit(::android::hidl::safe_union::V1_0::Monostate&&);
    ::android::hidl::safe_union::V1_0::Monostate& noinit();
    const ::android::hidl::safe_union::V1_0::Monostate& noinit() const;

    void value(::android::hardware::radio::V1_6::SscMode);
    ::android::hardware::radio::V1_6::SscMode& value();
    ::android::hardware::radio::V1_6::SscMode value() const;

    // Utility methods
    hidl_discriminator getDiscriminator() const;

    constexpr size_t hidl_getUnionOffset() const {
        return offsetof(::android::hardware::radio::V1_6::OptionalSscMode, hidl_u);
    }

private:
    void hidl_destructUnion();

    hidl_discriminator hidl_d __attribute__ ((aligned(1))) ;
    union hidl_union final {
        ::android::hidl::safe_union::V1_0::Monostate noinit __attribute__ ((aligned(1)));
        ::android::hardware::radio::V1_6::SscMode value __attribute__ ((aligned(1)));

        hidl_union();
        ~hidl_union();
    } hidl_u;

    static_assert(sizeof(::android::hardware::radio::V1_6::OptionalSscMode::hidl_union) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::OptionalSscMode::hidl_union) == 1, "wrong alignment");
    static_assert(sizeof(::android::hardware::radio::V1_6::OptionalSscMode::hidl_discriminator) == 1, "wrong size");
    static_assert(__alignof(::android::hardware::radio::V1_6::OptionalSscMode::hidl_discriminator) == 1, "wrong alignment");
};

static_assert(sizeof(::android::hardware::radio::V1_6::OptionalSscMode) == 2, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::OptionalSscMode) == 1, "wrong alignment");

/**
 * This struct represents a single route selection descriptor as defined in
 * 3GPP TS 24.526.
 */
struct RouteSelectionDescriptor final {
    /**
     * Precedence value in the range of 0 to 255. Higher value has lower
     * precedence.
     */
    uint8_t precedence __attribute__ ((aligned(1)));
    /**
     * Valid values are IP, IPV6 and IPV4V6.
     */
    ::android::hardware::radio::V1_6::OptionalPdpProtocolType sessionType __attribute__ ((aligned(4)));
    ::android::hardware::radio::V1_6::OptionalSscMode sscMode __attribute__ ((aligned(1)));
    /**
     * There can be 0 or more SliceInfo specified in a route descriptor.
     */
    ::android::hardware::hidl_vec<::android::hardware::radio::V1_6::SliceInfo> sliceInfo __attribute__ ((aligned(8)));
    /**
     * DNN stands for Data Network Name and represents an APN as defined in
     * 3GPP TS 23.003. There can be 0 or more DNNs specified in a route
     * descriptor.
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> dnn __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::RouteSelectionDescriptor, precedence) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::RouteSelectionDescriptor, sessionType) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::RouteSelectionDescriptor, sscMode) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::RouteSelectionDescriptor, sliceInfo) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::RouteSelectionDescriptor, dnn) == 32, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::RouteSelectionDescriptor) == 48, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::RouteSelectionDescriptor) == 8, "wrong alignment");

/**
 * Public key type from carrier certificate.
 */
enum class PublicKeyType : int8_t {
    EPDG = 1,
    WLAN = 2,
};

/**
 * Carrier specific Information sent by the carrier,
 * which will be used to encrypt the IMSI and IMPI.
 */
struct ImsiEncryptionInfo final {
    ::android::hardware::radio::V1_1::ImsiEncryptionInfo base __attribute__ ((aligned(8)));
    ::android::hardware::radio::V1_6::PublicKeyType keyType __attribute__ ((aligned(1)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::ImsiEncryptionInfo, base) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::ImsiEncryptionInfo, keyType) == 72, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::ImsiEncryptionInfo) == 80, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::ImsiEncryptionInfo) == 8, "wrong alignment");

/**
 * Phonebook-record-information specified by EF_ADN(Abbreviated dialing numbers)
 * record of SIM as per 3GPP spec 31.102 v15 Section-4.4.2.3.
 */
struct PhonebookRecordInfo final {
    /**
     * Record index. 0 is used to insert a record
     */
    uint32_t recordId __attribute__ ((aligned(4)));
    /**
     * Alpha identifier, empty string if no value
     */
    ::android::hardware::hidl_string name __attribute__ ((aligned(8)));
    /**
     * Dialling number, empty string if no value
     */
    ::android::hardware::hidl_string number __attribute__ ((aligned(8)));
    /**
     * Email addresses
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> emails __attribute__ ((aligned(8)));
    /**
     * Additional numbers
     */
    ::android::hardware::hidl_vec<::android::hardware::hidl_string> additionalNumbers __attribute__ ((aligned(8)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookRecordInfo, recordId) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookRecordInfo, name) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookRecordInfo, number) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookRecordInfo, emails) == 40, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookRecordInfo, additionalNumbers) == 56, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::PhonebookRecordInfo) == 72, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::PhonebookRecordInfo) == 8, "wrong alignment");

struct PhonebookCapacity final {
    /**
     * Maximum number of ADN records possible in the SIM phonebook
     * Needs to be non-negative
     */
    int32_t maxAdnRecords __attribute__ ((aligned(4)));
    /**
     * Used ADN records in the SIM phonebook
     * Needs to be non-negative
     */
    int32_t usedAdnRecords __attribute__ ((aligned(4)));
    /**
     * Maximum email records possible in the SIM phonebook
     * Needs to be non-negative
     */
    int32_t maxEmailRecords __attribute__ ((aligned(4)));
    /**
     * Used email records in the SIM phonebook
     * Needs to be non-negative
     */
    int32_t usedEmailRecords __attribute__ ((aligned(4)));
    /**
     * Maximum additional number records possible in the SIM phonebook
     * Needs to be non-negative
     */
    int32_t maxAdditionalNumberRecords __attribute__ ((aligned(4)));
    /**
     * Used additional number records in the SIM phonebook
     * Needs to be non-negative
     */
    int32_t usedAdditionalNumberRecords __attribute__ ((aligned(4)));
    /**
     * Maximum name length possible in the SIM phonebook
     * Needs to be non-negative
     */
    int32_t maxNameLen __attribute__ ((aligned(4)));
    /**
     * Maximum number length possible in the SIM phonebook
     * Needs to be non-negative
     */
    int32_t maxNumberLen __attribute__ ((aligned(4)));
    /**
     * Maximum email length possible in the SIM phonebook
     * Needs to be non-negative
     */
    int32_t maxEmailLen __attribute__ ((aligned(4)));
    /**
     * Maximum additional number length possible in the SIM phonebook
     * Needs to be non-negative
     */
    int32_t maxAdditionalNumberLen __attribute__ ((aligned(4)));
};

static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookCapacity, maxAdnRecords) == 0, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookCapacity, usedAdnRecords) == 4, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookCapacity, maxEmailRecords) == 8, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookCapacity, usedEmailRecords) == 12, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookCapacity, maxAdditionalNumberRecords) == 16, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookCapacity, usedAdditionalNumberRecords) == 20, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookCapacity, maxNameLen) == 24, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookCapacity, maxNumberLen) == 28, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookCapacity, maxEmailLen) == 32, "wrong offset");
static_assert(offsetof(::android::hardware::radio::V1_6::PhonebookCapacity, maxAdditionalNumberLen) == 36, "wrong offset");
static_assert(sizeof(::android::hardware::radio::V1_6::PhonebookCapacity) == 40, "wrong size");
static_assert(__alignof(::android::hardware::radio::V1_6::PhonebookCapacity) == 4, "wrong alignment");

/**
 * Enum representing the status of the received PB indication,
 * PB_RECEIVED_OK indicates this retrieval is fine
 * PB_RECEIVED_ERROR indicates one error happens, in general, the process
 *   can't be restored soon.
 * PB_RECEIVED_ABORT indicates the process is interrupted, in this case,
 *   modem might need resources and interrupt the current process, or it is
 *   timed out to receive all indications, and client can retry soon.
 * PB_RECEIVED_FINAL indicates the whole process is finished with a full
 *   chunk of phonebook data, means this is a last indication with the left
 *   data.
 */
enum class PbReceivedStatus : int8_t {
    PB_RECEIVED_OK = 1,
    PB_RECEIVED_ERROR = 2,
    PB_RECEIVED_ABORT = 3,
    PB_RECEIVED_FINAL = 4,
};

//
// type declarations for package
//

static inline std::string toString(const ::android::hardware::radio::V1_6::QosBandwidth& o);
